Repository: sunfounder/SunFounder_PiCar-S
Catalog: docs/locale/*/LC_MESSAGES/building_the_car.po
Languages: de

source: Building the Car
de: Das Auto bauen

source: Extremely excited when opening the box and checking so many components? Keep your patience and take it easy. Please note that some details in the following steps need **CAREFUL** observation. You should double-check your work based on the figures in the manual after finishing each step. Don’t worry! Kindly reminders will be given in some particular steps. Just follow the tutorial step by step. Okay, with no further ado, now let’s start!
de: Extrem aufgeregt beim Öffnen der Box und beim Überprüfen so vieler Komponenten? Behalten Sie Geduld und lassen Sie es ruhig angehen. Bitte beachten Sie, dass einige Details in den folgenden Schritten **SORGFÄLTIG** beachtet werden müssen. Sie sollten Ihre Arbeit anhand der Zahlen im Handbuch überprüfen, nachdem Sie jeden Schritt abgeschlossen haben. Keine Sorge! In einigen bestimmten Schritten werden freundliche Erinnerungen gegeben. Folgen Sie einfach dem Tutorial Schritt für Schritt. Okay, ohne weitere Umschweife, jetzt fangen wir an!

source: Front Half Chassis
de: Vorderes Halbgehäuse

source: Assemble the **Front Half Chassis** with four **M3x25 copper standoffs** and four **M3 nuts** as shown below:
de: Montieren Sie das **Front Half Chassis** mit vier **M3x25 Kupfer-Standoffs** und vier **M3-Muttern** wie unten gezeigt:

source: Front Wheels
de: Vorderreifen

source: Please pay attention to the direction of Steering Connector before assembling.
de: Bitte achten Sie vor dem Zusammenbau auf die Richtung des Lenkungssteckers.

source: Insert an **M4x25 screw** through a **Steering Connector**, 3 **Bearing Shields**, 3 **Hex Front Wheel Fixing Plates**, and a **front wheel**, into an **M4 Self-locking Nut** (note the direction) as shown below:
de: Stecken Sie eine **M4x25-Schraube** durch einen **Lenkungsanschluss**, 3 **Lagerschilde**, 3 **Sechskant-Vorderrad-Befestigungsplatten** und ein **Vorderrad** in ein **M4 Selbstsichernde Mutter** (Richtung beachten) wie unten gezeigt:

source: You can use the Cross Socket Wrench to secure the **M4 Self-locking Nut**, then use the screwdriver to tighten the **M4x25 screw.**
de: Sie können den Kreuzschlitzschlüssel verwenden, um die **M4 selbstsichernde Mutter** zu sichern, und dann den Schraubendreher verwenden, um die **M4x25 Schraube anzuziehen.**

source: The Self-locking Nut should be screwed tight enough. It would be better to tighten the screw until the wheel and Steering Connector cannot move first, then loosen the screw a little, so that the Steering Plate can just move. Thus, the wheel can turn flexibly when the connection would not be too loose.
de: Die selbstsichernde Mutter sollte fest genug angezogen werden. Es ist besser, die Schraube festzuziehen, bis sich das Rad und der Lenkungsanschluss nicht bewegen können, und dann die Schraube ein wenig lösen, damit sich die Lenkungsplatte gerade bewegen kann. Somit kann sich das Rad flexibel drehen, wenn die Verbindung nicht zu locker wäre.

source: Assemble the other front wheel in the same way, but bear in mind the Steering Connector on the wheel should be symmetric with the previous one:
de: Montieren Sie das andere Vorderrad auf die gleiche Weise, aber denken Sie daran, dass der Lenkungsanschluss am Rad symmetrisch zum vorherigen sein sollte:

source: Now two front wheels have finished assembly.
de: Jetzt sind zwei Vorderräder fertig montiert.

source: Steering Part
de: Lenkungsteil

source: Connect the **Steering Linkage** and the **1-arm Rocker Arm** with the **M1.5x4 Self-tapping Screw**.
de: Verbinden Sie das **Lenkgestänge** und den **1-armigen Kipphebel** mit der **M1,5x4 Blechschraube**.

source: Insert it into the FIRST hole of the arm (as indicated by the arrow below) which is the farthest from the gears.
de: Stecken Sie es in das ERSTE Loch des Arms (wie durch den Pfeil unten angezeigt), das am weitesten von den Zahnrädern entfernt ist.

source: Fasten them as tightly as possible, and then loosen the screw a little so the Steering Linkage can move flexibly.
de: Ziehen Sie sie so fest wie möglich an und lösen Sie dann die Schraube ein wenig, damit sich das Lenkgestänge flexibel bewegen kann.

source: Upper Plate
de: Oberer Teller

source: Mount the **M2.5x8 copper standoffs** and **M2.5 nuts** into the **upper plate** first. Pay attention that the side the protruding prop should face up.
de: Montieren Sie zuerst die **M2,5x8 Kupferabstandshalter** und **M2,5 Muttern** in die **obere Platte**. Achten Sie darauf, dass die Seite der hervorstehenden Stütze nach oben zeigt.

source: Battery Holder
de: Batteriehalter

source: Turn the Upper Plate upside down. Cut the **ribbon** into two halves. Thread them through the holes on the plate. Pay attention to the direction and leave one end longer out of the plate for each to remove the battery easily later.
de: Drehen Sie die obere Platte auf den Kopf. Schneiden Sie das **Band** in zwei Hälften. Fädeln Sie sie durch die Löcher auf der Platte. Achten Sie auf die Richtung und lassen Sie jeweils ein Ende länger aus der Platte, um den Akku später leicht entnehmen zu können.

source: Fasten the battery holder with two **M3x8 countersunk screws** and two **M3 nuts**: pay attention to the direction of battery holder’s wire.
de: Befestigen Sie den Batteriehalter mit zwei **M3x8 Senkschrauben** und zwei **M3-Muttern**: Achten Sie auf die Kabelrichtung des Batteriehalters.

source: Rear Wheels (Screws)
de: Hinterräder (Schrauben)

source: Insert four **M3x8 screws** with four **M3x25 copper standoffs**:
de: Setzen Sie vier **M3x8-Schrauben** mit vier **M3x25-Kupferabstandshaltern** ein:

source: PCB Assembly
de: Leiterplattenmontage

source: Assemble the **Raspberry Pi** (TF Card inserted) with eight **M2.5x8 copper standoffs**, then plug the **Robot HATS** onto it.
de: Montieren Sie den **Raspberry Pi** (TF-Karte eingesteckt) mit acht **M2,5x8 Kupfer-Abstandshaltern** und stecken Sie dann die **Robot HATS** darauf.

source: Fix the **Robot HATS** with four **M2.5x6** **screws**.
de: Befestigen Sie die **Robot HATS** mit vier **M2.5x6** **Schrauben**.

source: Fix The **PCA9685 PWM Driver**, the **Motor Driver** with eight **M2.5x12** **screws and M2.5 nuts** into the **down plate**.
de: Befestigen Sie den **PCA9685 PWM Driver**, den **Motor Driver** mit acht **M2.5x12** **Schrauben und M2.5 Muttern** in der **Unterplatte**.

source: Rear Wheels (Driving)
de: Hinterräder (Fahren)

source: Assemble the two motors to the Back Half Chassis with four **M3x25 screws** and **M3 nuts**. Pay attention to place the motors with wires inward, providing convenience for connecting the circuit.
de: Montieren Sie die beiden Motoren mit vier **M3x25-Schrauben** und **M3-Muttern** am Back Half Chassis. Achten Sie darauf, die Motoren mit den Drähten nach innen zu platzieren, um den Anschluss des Stromkreises zu erleichtern.

source: Assemble the rear wheels with 4 M3 nuts.
de: Montieren Sie die Hinterräder mit 4 M3-Muttern.

source: Align the **rear** **wheels** with the motor shaft, and rotate to insert them gently.
de: Richten Sie die **hinteren** **Räder** mit der Motorwelle aus und drehen Sie sie, um sie vorsichtig einzusetzen.
