Repository: sunfounder/SunFounder_PiCar-S
Catalog: docs/locale/*/LC_MESSAGES/calibration.po
Languages: de, ja

source: Calibration
de: Kalibrierung
ja: 補正

source: Calibrate the Servo
de: Kalibrieren Sie den Servo
ja: サーボを補正する

source: Remember the commands to adjust the servo to 90 degrees previously? Now, let’s talk about the other two commands.
de: Erinnern Sie sich an die Befehle, um das Servo zuvor auf 90 Grad einzustellen? Kommen wir nun zu den anderen beiden Befehlen.
ja: 以前にサーボを90度に調整するコマンドを覚えているか？今回、他の2つのコマンドについて説明する。

source: The second command **front-wheel-test** is used to test whether the front wheels can turn flexibly after assembly. When you run this command, it will drive them to turn left and right.
de: Mit dem zweiten Befehl **front-wheel-test** wird getestet, ob sich die Vorderräder nach der Montage flexibel drehen lassen. Wenn Sie diesen Befehl ausführen, werden sie dazu gebracht, nach links und rechts abzubiegen.
ja: 2番目のコマンド **front-wheel-test** は、組み立て後に前輪が柔軟に回転できるかどうかをテストするために使用される。このコマンドを実行すると、左右に駆動する。

source: You may find the direction of the front wheels is not facing exactly front when they are in the straight status. If there is an obvious deviation from the middle line of the front chassis, reassemble the servo and run **servo-install** again; if it is just a little deviation (like about 0~15 degrees), it can be adjusted by software.
de: Möglicherweise stellen Sie fest, dass die Richtung der Vorderräder nicht genau nach vorne zeigt, wenn sie sich im Geradeaus-Zustand befinden. Bei offensichtlicher Abweichung von der Mittellinie des vorderen Chassis das Servo wieder zusammenbauen und **servo-install** erneut ausführen; Wenn es nur eine kleine Abweichung ist (wie etwa 0 ~ 15 Grad), kann sie per Software angepasst werden.
ja: 前輪がまっすぐな状態では、前輪の方向が正確に前を向いていない場合がある。フロントシャーシの真ん中の線から明らかなずれがある場合は、サーボを組み立て直して、もう一度 **servo-instal** を実行する。ほんの少しのずれ（約0〜15度のような）であるならば、ソフトウェアによって調整することができる。

source: Get into the folder **SunFounder_PiCar/picar:**
de: Gehe in den Ordner **SunFounder_PiCar/picar:**
ja: **SunFounder_PiCar/picar** フォルダーを開く：

source: Open the **config** file under the folder with an editor. You can see a few parameters. The value of **turning_offset** is used to adjust the front wheels. Its value is **0** by default. If you want to make the front wheels **turn right a bit**, just modify it to a **larger numbe**\ r; to make it more **towards the left**, you can set it **smaller** (it can even be a negative number).
de: Öffnen Sie die **config**-Datei unter dem Ordner mit einem Editor. Sie können einige Parameter sehen. Der Wert von **turning_offset** wird verwendet, um die Vorderräder einzustellen. Der Wert ist standardmäßig **0**. Wenn Sie möchten, dass die Vorderräder **etwas rechts abbiegen**, ändern Sie sie einfach in eine **größere Nummer**\ r; um es **nach links** weiter zu machen, können Sie es **kleiner** einstellen (es kann sogar eine negative Zahl sein).
ja: エディターでフォルダーの **config** ファイルを開く。いくつかのパラメーターが表示される。**turning_offset** の値は、前輪を調整するために使用される。デフォルトではその値は **0** となっている。前輪を **少し右に回したい** 場合は、**大きな値** に変更してください。**左寄りにする** には、**小さい値** に設定する（負の数に設定できる）。

source: But **DO NOT** over-configure the wheels (recommended a value between -30 and 30), or the servo may be stuck and broken.
de: Aber **NICHT** überkonfigurieren Sie die Räder (empfohlener Wert zwischen -30 und 30), oder das Servo kann stecken bleiben und kaputt gehen.
ja: ただし、ホイールを過度に構成 **DO NOT** でください（-30〜30の推奨値）。そうしないと、サーボが動かなくなったり壊れたりする恐れがある。

source: After changing the value of turning_offset, press **Ctrl** + **O** to save the changes, and press **Ctrl** + **X** to exit. Run the command **picar servo-install** to check the front wheel’s status.
de: Nachdem Sie den Wert von turn_offset geändert haben, drücken Sie **Strg** + **O**, um die Änderungen zu speichern, und drücken Sie **Strg** + **X** zum Beenden. Führen Sie den Befehl **picar servo-install** aus, um den Status des Vorderrads zu überprüfen.
ja: Turning_offsetの値を変更した後、**Ctrl+O** を押して変更を保存し、**Ctrl+X** を押して終了する。**picar servo-install** コマンドを実行して、前輪のステータスを確認する。

source: If the front wheels is still not facing the exact front, you may need to edit the file **config** for a couple of times. The front wheels may need to be adjusted about 3 to 5 times usually. We can move on to calibration of the rear wheels when the front wheels are done.
de: Wenn die Vorderräder immer noch nicht genau nach vorne zeigen, müssen Sie die Datei **config** möglicherweise einige Male bearbeiten. Die Vorderräder müssen in der Regel etwa 3- bis 5-mal eingestellt werden. Wir können mit der Kalibrierung der Hinterräder fortfahren, wenn die Vorderräder fertig sind.
ja: そして前輪が正面を向いていない場合は、ファイル **config** を数回編集する必要がある。通常3〜5回程度調整する必要がある。前輪の補正が完了したら、後輪の補正に進む。

source: Calibrate the Motors
de: Kalibrieren Sie die Motoren
ja: モーターを補正する

source: Since the wiring of the two DC motors is random, the VCC and GND of a motor may be connected to the wheel reversely, causing the wheel to spin forward when it should do backward as configured in the code. Thus we can use the third command which will drive the rear wheels to simultaneously speed up and slow down alternately.
de: Da die Verdrahtung der beiden Gleichstrommotoren zufällig ist, können VCC und GND eines Motors umgekehrt mit dem Rad verbunden werden, wodurch das Rad vorwärts dreht, wenn es wie im Code konfiguriert rückwärts laufen sollte. So können wir den dritten Befehl verwenden, der die Hinterräder antreibt, um gleichzeitig abwechselnd zu beschleunigen und zu verlangsamen.
ja: 2つのDCモーターの配線はランダムであるため、モーターのVCCとGNDがホイールに逆に接続され、コードで構成されているように車輪が逆方向に回転すべきときに、正面に回転してしまう場合がある。したがって、後輪を交互に加速と減速を同時に行う3番目のコマンドを使用できる。

source: Check whether both the two rear wheels rotate direction is the same as the screen. Note that the two wheels are driven by the two motors separately. It may happen that one rotates forward, while the other does backwards. If so, we need to adjust one or both two wheels which rotate reversely under that command.
de: Prüfen Sie, ob die Drehrichtung der beiden Hinterräder mit der des Bildschirms übereinstimmt. Beachten Sie, dass die beiden Räder von den beiden Motoren separat angetrieben werden. Es kann vorkommen, dass einer vorwärts dreht, während der andere rückwärts dreht. Wenn dies der Fall ist, müssen wir eines oder beide Räder einstellen, die sich unter diesem Befehl rückwärts drehen.
ja: 後輪の回転方向が画面と同じかどうかを確認してください。2つの車輪は2つのモーターによって別々に駆動されることに注意してください。一つが前方に回転し、もう一つが後方に回転する場合がある。その場合は、そのコマンドで逆回転する1つまたは両方のホイールを調整する必要がある。

source: **forward_A** and **forward_B** are to change the default spinning direction of the two motors. The value can only be **0** or **1**, which represents clockwise and counterclockwise rotation. By default, it's **0** for both parameters. Thus if a wheel spins reversely, you only need to change the corresponding parameter for the wheel to **1**.
de: **forward_A** und **forward_B** dienen zum Ändern der Standarddrehrichtung der beiden Motoren. Der Wert kann nur **0** oder **1** sein, was einer Drehung im und gegen den Uhrzeigersinn entspricht. Standardmäßig ist es für beide Parameter **0**. Wenn sich also ein Rad rückwärts dreht, müssen Sie nur den entsprechenden Parameter für das Rad auf **1** ändern.
ja: **forward_A** と **forward_B** は2つのモーターのデフォルトの回転方向を変更する。値は **0** または **1** のみで、時計回りと反時計回りの回転を表す。デフォルトでは、両方のパラメーターで **0** となっている。したがって、車輪が逆回転する場合は、ホイールの対応するパラメーターを **1** に変更するだけである。

source: Press **Ctrl** + **O** to save the changes, and press **Ctrl** + **X** to exit.
de: Drücken Sie **Strg** + **O**, um die Änderungen zu speichern, und drücken Sie **Strg** + **X**, um den Vorgang zu beenden.
ja: **Ctrl+O** を押して変更を保存し、**Ctrl+X** を押して終了する。

source: Run the command **picar rear-wheel-test** again to check whether the rear wheels are rotating in accordance with the command.
de: Führen Sie den Befehl **picar heckrad-test** erneut aus, um zu überprüfen, ob sich die Hinterräder entsprechend dem Befehl drehen.
ja: コマンド **picar Rear-wheel-test** を再度実行して、コマンドに従って後輪が回転しているかどうかを確認する。

source: Copy *config* to the directory *example* under *PiCar-S*.
de: Kopieren Sie *config* in das Verzeichnis *example* unter *PiCar-S*.
ja: **config** を **PiCar-S** の下のディレクトリの **example** にコピーする。
