Repository: sunfounder/SunFounder_PiCar-S
Catalog: docs/locale/*/LC_MESSAGES/combination.po
Languages: de, ja

source: Combination
de: Kombination
ja: 組合せ

source: So, this smart car now is smart in three separate features. But, you think only one sensor module is not enough? Try to combine those sensor modules in one! Here we can show you an experiment - light following with obstacle avoidance for reference.
de: Also, dieses smarte Auto ist jetzt in drei verschiedenen Funktionen smart. Aber Sie denken, nur ein Sensormodul reicht nicht? Versuchen Sie, diese Sensormodule in einem zu kombinieren! Hier können wir Ihnen ein Experiment zeigen - Lichtverfolgung mit Hindernisvermeidung als Referenz.
ja: したがって、このスマートカーは3つの異なる機能でスマートになる。しかし、1つのセンサーモジュールだけでは十分ではないと思っているか？それらのセンサーモジュールを1つに組み合わせてみてください！ここでは、実験を示す-参照用の障害物回避によるライトフォロー。

source: When the car runs with the light follower, sometimes it may crash into obstacles when following the light, and it’s not quite convenient to let the car move back (though we've set the car to move backward if the array is [1,0,1], it’s hard to acquire these values since the the car is moving and the light cannot be exactly as required sometimes). So we consider Also, you can let the car move backwards by a paper board or your foot, which is quite easy.
de: Wenn das Auto mit dem Lichtfolger fährt, kann es manchmal gegen Hindernisse prallen, wenn es dem Licht folgt, und es ist nicht ganz praktisch, das Auto zurückfahren zu lassen (obwohl wir das Auto so eingestellt haben, dass es sich rückwärts bewegt, wenn das Array [1,0 . ist ,1], es ist schwierig, diese Werte zu erfassen, da das Auto in Bewegung ist und das Licht manchmal nicht genau so sein kann, wie es erforderlich ist). Wir überlegen also auch, dass Sie das Auto mit einem Pappbrett oder Ihrem Fuß rückwärts fahren lassen können, was ganz einfach ist.
ja: ライトフォロアを使用して車を走行させると、ライトを追うときに障害物にぶつかる場合がある。また、車を後退させるのはあまり便利ではない（ただし、配列が[1,0,1]である場合、車を後退させると設定したが、車が動いていて、ライトが時々正確にできない場合があるため、これらの値を取得することは難しい）。だから、板紙や足で車を後退させることもできるので、それがとても簡単である。

source: Check below the program of this example.
de: Sehen Sie sich unten das Programm dieses Beispiels an.
ja: この例のプログラムを以下で確認してください。

source: Assemble the light follower module and ultrasonic obstacle avoidance module on the car first.
de: Montieren Sie zuerst das Lichtfolgermodul und das Ultraschall-Hindernisvermeidungsmodul am Auto.
ja: まず、車のライトフォロアモジュールと超音波障害物回避モジュールを組み立てる。

source: Log into the Raspberry Pi on your computer via ssh, and get into the directory
de: Melden Sie sich auf Ihrem Computer per ssh am Raspberry Pi an und gelangen Sie in das Verzeichnis
ja: ssh経由でコンピューターのRaspberry Piにログインし、ディレクトリに入る

source: Run the code.
de: Führen Sie den Code aus.
ja: コードを実行する。

source: How it works
de: Wie es funktioniert
ja: 動作原理

source: Set the obstacle avoidance as a superior priority than light following: if there is an obstacle in front of the car, it walk away from the obstacle and back to the track; if not, then the car will keep follow light.
de: Stellen Sie die Hindernisvermeidung als Vorrang vor der Lichtverfolgung ein: Wenn sich ein Hindernis vor dem Auto befindet, geht es vom Hindernis weg und zurück auf die Strecke; Wenn nicht, wird das Auto das Licht verfolgen.
ja: 障害物回避をライトフォローよりも優先順位を高く設定する。車の前に障害物がある場合、障害物から離れて軌道に戻る。そうでない場合、車はライトを追従する。

source: Since the light following and obstacle avoidance of the car depend on the sensor modules, we set two functions to read the status of two sensors separately, and assign values to flags to be returned from the functions: **state_light()**, and **state_sonic()**.
de: Da die Lichtverfolgung und Hindernisvermeidung des Autos von den Sensormodulen abhängen, setzen wir zwei Funktionen, um den Status von zwei Sensoren separat zu lesen, und weisen Flags Werte zu, die von den Funktionen zurückgegeben werden: **state_light()**, und **state_sonic()**.
ja: 車のライトフォローと障害物回避はセンサーモジュールに依存するため、2つのセンサーのステータスを個別に読み取る2つの関数を設定し、それらの関数から返されるフラグに値を割り当てる：**state_light()** と **state_sonic()**。

source: In the function **state_sonic()**, the return value is **avoid_flag**.
de: In der Funktion **state_sonic()** ist der Rückgabewert **avoid_flag**.
ja: 関数 **state_sonic()** は、戻り値は **avoid_flag** である。

source: If the car is **close to** an obstacle, it will return **avoid_flag =2**;
de: Wenn sich das Auto **nahe** an einem Hindernis befindet, wird **avoid_flag =2** zurückgegeben;
ja: 車が障害物に **接近している** 場合は、**avoid_flag=2** を返す；

source: if it is **too close to** the obstacle, it will return **avoid_flag =1**;
de: wenn es **zu nah** am Hindernis ist, wird **avoid_flag =1** zurückgegeben;
ja: 障害物に **近すぎる** 場合は、**avoid_flag = 1** を返す；

source: if ahead **no obstacle** is detected near, it will return **avoid_flag =0**.
de: Wenn voraus **kein Hindernis** in der Nähe erkannt wird, wird **avoid_flag =0** zurückgegeben.
ja: 前方に障害物が **検出されない** 場合は、**avoid_flag = 0** を返す。

source: In the function **state_light()**, the return value is **light_flag**.
de: In der Funktion **state_sonic()** ist der Rückgabewert **avoid_flag**.
ja: 関数 **state_light()** では、戻り値は **light_flag** である。

source: If the light spot is **in front of** the car, it will return **light_flag = 0**;
de: Wenn sich der Lichtpunkt **vor** dem Auto befindet, wird **light_flag = 0** zurückgegeben;
ja: ライトスポットが車の **前にある** 場合、**light_flag = 0** を返す；

source: if the spot is **at the right side**, it will return **light_flag = 1**;
de: wenn der Punkt **auf der rechten Seite** ist, wird **light_flag = 1** zurückgegeben;
ja: スポットが **右側にある** 場合、**light_flag = 1** を返す；

source: if the spot is **at the left side**, it will return **light_flag = 2**;
de: wenn der Punkt **auf der linken Seite** ist, wird **light_flag = 2** zurückgegeben;
ja: スポットが **左側にある** 場合、**light_flag = 2** を返す；

source: if the spot is **at the back**, it will return **light_flag = 3**;
de: wenn der Punkt **hinten** ist, wird **light_flag = 3** zurückgegeben;
ja: スポットが **後ろにある** 場合、**light_flag = 3** を返す；

source: if **no light spot** is detected, it will return **light_flag = 4**.
de: Wenn **kein Lichtfleck** erkannt wird, wird **light_flag = 4** zurückgegeben.
ja: **光点が検出されない** 場合、**light_flag = 4** を返す。

source: The main program **main()** will run the corresponding program according to **avoid_flag** and **light_flag**, and the **avoid_flag** is superior in priority.
de: Das Hauptprogramm **main()** führt das entsprechende Programm gemäß **avoid_flag** und **light_flag** aus, wobei **avoid_flag** vorrangig ist.
ja: メインプログラム **main()** は、**8avoid_flag** と **light_flag** に従って対応するプログラムを実行し、**avoid_flag** は優先順位となっている。
