Repository: sunfounder/SunFounder_PiCar-S
Catalog: docs/locale/*/LC_MESSAGES/components_list.po
Languages: de, ja

source: Components List
de: Komponenten
ja: 部品一覧

source: Structure Plates
de: Strukturplatten
ja: 構造プレート

source: Upper Plate x 1
de: Obere Platte x 1
ja: 上部プレートx 1

source: Front Half Chassis x 1
de: Vorderes halbes Chassis x 1
ja: 全部ハーフシャーシx1

source: Hex Front Wheel Fixing Plate x 8
de: Sechskant-Vorderrad-Befestigungsplatte x 8
ja: 六角前輪固定プレート×8

source: Ultrasonic Support x 1
de: Ultraschallunterstützung x 1
ja: 超音波サポートx1

source: Bearing Shield x 8
de: Lagerschild x 8
ja: ベアリングシールドx 8

source: Steering Linkage x 1
de: Lenkgestänge x 1
ja: ステアリングリンケージ×1

source: Steering Connector x 2
de: Lenkungsanschluss x 2
ja: ステアリングコネクターx2

source: Ultrasonic Connector x 1
de: Ultraschallunterstützung x 1
ja: 超音波コネクターx1

source: Back Half Chassis x 1
de: Hinteres halbes Chassis x 1
ja: 後部ハーフシャーシx1

source: Sensor Connector x 1
de: Lenkgestänge x 1
ja: センサーコネクターx1

source: SunFounder SF006C Servo x 1
ja: SunFounder SF006Cサーボx1

source: Servo x 1
ja: サーボx1

source: 1-arm Rocker Arm x 1
de: 1-armiger Kipphebel x 1
ja: 1アームロッカーアームx1

source: arm Rocker Arm x 1
de: Arm Kipphebel x 1
ja: アームロッカーアーム×1

source: 4-arm Rocker Arm x 1
de: 4-Arm-Kipphebel x 1
ja: 4アームロッカーアームx1

source: Rocker Arm Fixing Screw x 1
de: Kipphebel-Befestigungsschraube x 1
ja: ロッカーアーム固定ネジ×1

source: Rocker Arm Screw
de: Kipphebelschraube
ja: ロッカーアームねじ

source: Mechanical Fasteners
de: Mechanische Befestigungselemente
ja: メカニカルファスナー

source: Wires
de: Drähte
ja: 配線

source: Other Components
de: Andere Komponenten
ja: その他の部品

source: Tools
de: Werkzeuge
ja: 工具

source: Self-provided Components
de: Eigene Komponenten
ja: 別途用意する必要な部品

source: The following components are not included in this kit.
de: Die folgenden Komponenten sind nicht in diesem Kit enthalten.
ja: このキットには以下の成分が含まれていません。

source: 1. You are recommend to use 18650 batteries **without** a protective board. Otherwise, the car may be cut power and stop running because of the overcurrent protection of the protective board.
de: 1. Es wird empfohlen, 18650er Akkus **ohne** Schutzplatine zu verwenden. Andernfalls kann die Stromversorgung des Fahrzeugs unterbrochen werden und aufgrund des Überstromschutzes der Schutzplatine nicht mehr laufen.
ja: 保護ボードなしの 18650 バッテリーを使用することを推奨します。他のバッテリーを使用すると、保護ボードの過電流保護により、製品の電源が切れて動作を停止する可能性があります。

source: 2. For unprotected batteries, please purchase those with the anode bulged out (as shown below), so that it can ensure the well connection with the battery holder.
de: 2. Bei ungeschützten Batterien kaufen Sie bitte solche mit herausgewölbter Anode (wie unten gezeigt), damit die gute Verbindung mit dem Batteriehalter gewährleistet ist.
ja: 保護回路なしのバッテリーの場合は、バッテリーホルダーとの接続を確実にするために、アノードが膨らんでいる(正極が尖った)バッテリーを購入してください（以下を参照）。

source: 3. In order to keep the car working for a long time, use large-capacity batteries as much as possible.
de: 3. Um das Auto lange funktionsfähig zu halten, verwenden Sie so oft wie möglich Batterien mit hoher Kapazität.
ja: 長時間使用するために、可能な限り最大電力のバッテリーを使用してください。
