Repository: sunfounder/SunFounder_PiCar-S
Catalog: docs/locale/*/LC_MESSAGES/get_started_with_raspberry_pi.po
Languages: de

source: Get Started with Raspberry Pi
de: Erste Schritte mit Raspberry Pi

source: In this chapter, we firstly learn to start up Raspberry Pi. The content includes installing the OS, Raspberry Pi network and how to open terminal.
de: In diesem Kapitel lernen wir zunächst, wie man Raspberry Pi in Betrieb nimmt. Der Inhalt umfasst die Installation des Betriebssystems, des Raspberry Pi-Netzwerks und das Öffnen des Terminals.

source: You can check the complete tutorial on the official website of the Raspberry Pi: https://projects.raspberrypi.org/en/projects/raspberry-pi-setting-up.
de: Sie können das vollständige Tutorial auf der offiziellen Website des Raspberry Pi nachlesen: https://projects.raspberrypi.org/en/projects/raspberry-pi-setting-up.

source: If your Raspberry Pi is set up, you can skip the part and go into the next chapter.
de: Wenn Ihr Raspberry Pi eingerichtet ist, können Sie den Teil überspringen und mit dem nächsten Kapitel fortfahren.

source: Installing the OS
de: Installieren des Betriebssystems

source: **Required Components**
de: **Erforderliche Komponenten**

source: Any Raspberry Pi
de: Jeder Raspberry Pi

source: 1 \* Micro SD card
de: 1 \* Micro-SD-Karte

source: **Step 1**
de: **Schritt 1**

source: Raspberry Pi have developed a graphical SD card writing tool that works on Mac OS, Ubuntu 18.04 and Windows, and is the easiest option for most users as it will download the image and install it automatically to the SD card.
de: Raspberry Pi hat ein grafisches Tool zum Schreiben von SD-Karten entwickelt, das unter Mac OS, Ubuntu 18.04 und Windows funktioniert und für die meisten Benutzer die einfachste Option ist, da es das Image herunterlädt und automatisch auf der SD-Karte installiert.

source: Visit the download page: https://www.raspberrypi.org/software/. Click on the link for the Raspberry Pi Imager that matches your operating system, when the download finishes, click it to launch the installer.
de: Besuchen Sie die Download-Seite: https://www.raspberrypi.org/software/. Klicken Sie auf den Link für den Raspberry Pi Imager, der Ihrem Betriebssystem entspricht. Wenn der Download abgeschlossen ist, klicken Sie darauf, um das Installationsprogramm zu starten.

source: **Step 2**
de: **Schritt 2**

source: When you launch the installer, your operating system may try to block you from running it. For example, on Windows I receive the following message:
de: Wenn Sie das Installationsprogramm starten, versucht Ihr Betriebssystem möglicherweise, Sie daran zu hindern, es auszuführen. Unter Windows erhalte ich beispielsweise die folgende Meldung:

source: If this pops up, click on **More info** and then **Run anyway**, then follow the instructions to install the Raspberry Pi Imager.
de: Wenn dies angezeigt wird, klicken Sie auf **Weitere Informationen** und dann auf **Trotzdem ausführen** und befolgen Sie dann die Anweisungen zur Installation des Raspberry Pi Imager.

source: **Step 3**
de: **Schritt 3**

source: Insert your SD card into the computer or laptop SD card slot.
de: Stecken Sie Ihre SD-Karte in den SD-Kartensteckplatz des Computers oder Laptops.

source: **Step 4**
de: **Schritt 4**

source: In the Raspberry Pi Imager, select the OS that you want to install and the SD card you would like to install it on.
de: Wählen Sie im Raspberry Pi Imager das Betriebssystem aus, das Sie installieren möchten, und die SD-Karte, auf der Sie es installieren möchten.

source: You will need to be connected to the internet the first time.
de: Sie müssen beim ersten Mal mit dem Internet verbunden sein.

source: That OS will then be stored for future offline use(lastdownload.cache, C:/Users/yourname/AppData/Local/Raspberry Pi/Imager/cache, ). So the next time you open the software, it will have the display "Released: date, cached on your computer".
de: Dieses Betriebssystem wird dann für die zukünftige Offline-Nutzung gespeichert (lastdownload.cache, C:/Users/yourname/AppData/Local/Raspberry Pi/Imager/cache, ). Wenn Sie die Software das nächste Mal öffnen, wird die Anzeige "Freigegeben: Datum, auf Ihrem Computer zwischengespeichert" angezeigt.

source: **Step 5**
de: **Schritt 5**

source: Select the SD card you are using.
de: Wählen Sie die von Ihnen verwendete SD-Karte aus.

source: **Step 6**
de: **Schritt 6**

source: Press **Ctrl+Shift+X** to open the **Advanced options** page to enable SSH and configure wifi, these 2 items must be set, the others depend on your choice . You can choose to always use this image customization options.
de: Drücken Sie **Strg+Umschalt+X**, um die Seite **Erweiterte Optionen** zu öffnen, um SSH zu aktivieren und WLAN zu konfigurieren. Diese 2 Elemente müssen eingestellt werden, die anderen hängen von Ihrer Wahl ab. Sie können diese Bildanpassungsoptionen immer verwenden.

source: Then scroll down to complete the wifi configuration and click **SAVE**.
de: Scrollen Sie dann nach unten, um die WLAN-Konfiguration abzuschließen, und klicken Sie auf **SPEICHERN**.

source: **wifi country** should be set the two-letter `ISO/IEC alpha2 code <https://en.wikipedia.org/wiki/ISO_3166-1_alpha-2#Officially_assigned_code_elements>`__ for the country in which you are using your Raspberry Pi, please refer to the following link: https://en.wikipedia.org/wiki/ISO_3166-1_alpha-2#Officially_assigned_code_elements.
de: **WLAN-Land** sollte der aus zwei Buchstaben bestehende ISO/IEC Alpha2-Code `ISO/IEC alpha2 code <https://en.wikipedia.org/wiki/ISO_3166-1_alpha-2#Officially_assigned_code_elements>`__ für das Land sein, in dem Sie verwenden Ihres Raspberry Pi finden Sie unter folgendem Link: https://en.wikipedia.org/wiki/ISO_3166-1_alpha-2#Officially_assigned_code_elements.

source: **Step 7**
de: **Schritt 7**

source: Click the **WRITE** button.
de: Klicken Sie auf die Schaltfläche **SCHREIBEN**.

source: **Step 8**
de: **Schritt 8**

source: If your SD card currently has any files on it, you may wish to back up these files first to prevent you from permanently losing them. If there is no file to be backed up, click **Yes**.
de: Wenn sich auf Ihrer SD-Karte derzeit Dateien befinden, sollten Sie diese Dateien möglicherweise zuerst sichern, um zu verhindern, dass Sie sie dauerhaft verlieren. Wenn keine Datei zum Sichern vorhanden ist, klicken Sie auf **Ja**.

source: **Step 9**
de: **Schritt 9**

source: After waiting for a period of time, the following window will appear to represent the completion of writing.
de: Nach einer gewissen Wartezeit erscheint das folgende Fenster, das den Abschluss des Schreibens darstellt.

source: Power on the Raspberry Pi
de: Schalten Sie den Raspberry Pi ein

source: Now, the Raspberry Pi OS is configured. You can plug out the USB card reader and then plug the Micro SD card into the Raspberry Pi.
de: Nun ist das Raspberry Pi OS konfiguriert. Sie können den USB-Kartenleser ausstecken und dann die Micro-SD-Karte in den Raspberry Pi stecken.

source: Put two 18650 fully charged batteries in the holder, plug the wires from the battery holder into the development board then toggle the switch from off to on. You are also recommended to use the power adapter of Raspberry Pi to power your car for that the first test will take a long time.
de: Legen Sie zwei voll aufgeladene 18650-Akkus in den Halter, stecken Sie die Drähte vom Akkuhalter in die Entwicklungsplatine und schalten Sie den Schalter von Aus auf Ein. Es wird auch empfohlen, das Netzteil des Raspberry Pi zu verwenden, um Ihr Auto mit Strom zu versorgen, damit der erste Test lange dauert.

source: Get the IP Address
de: Holen Sie sich die IP-Adresse

source: After the Raspberry Pi is powered on, we need to get the IP address of it. There are many ways to know the IP address, and two of them are listed as follows.
de: Nachdem der Raspberry Pi eingeschaltet ist, müssen wir die IP-Adresse davon abrufen. Es gibt viele Möglichkeiten, die IP-Adresse zu ermitteln, und zwei davon sind im Folgenden aufgeführt.

source: **1. Checking via the router**
de: **1. Überprüfung über den Router**

source: If you have permission to log in the router(such as a home network), you can check the addresses assigned to Raspberry Pi on the admin interface of router.
de: Wenn Sie die Berechtigung haben, sich am Router anzumelden (z. B. ein Heimnetzwerk), können Sie die dem Raspberry Pi zugewiesenen Adressen auf der Admin-Oberfläche des Routers überprüfen.

source: The default hostname of the system, Raspberry Pi OS is **raspberrypi**, and you need to find it. (If you are using ArchLinuxARM system, please find alarmpi.)
de: Der Standard-Hostname des Systems, Raspberry Pi OS, ist **raspberrypi**, und Sie müssen ihn finden. (Wenn Sie das ArchLinuxARM-System verwenden, finden Sie alarmpi.)

source: **2. Network Segment Scanning**
de: **2. Scannen von Netzwerksegmenten**

source: You can also use network scanning to look up the IP address of Raspberry Pi. You can apply the software, **Advanced IP scanner(download from Google)**.
de: Sie können auch den Netzwerk-Scan verwenden, um die IP-Adresse des Raspberry Pi zu ermitteln. Sie können die Software **Erweiterter IP-Scanner (Download von Google)** anwenden.

source: Click **Scan** and the name of all connected devices will be displayed. Similarly, the default hostname of the Raspberry Pi OS is **raspberrypi**, now you need to find the hostname and its IP.
de: Klicken Sie auf **Scan** und die Namen aller verbundenen Geräte werden angezeigt. Ebenso ist der Standard-Hostname des Raspberry Pi-Betriebssystems **raspberrypi**, jetzt müssen Sie den Hostnamen und seine IP finden.

source: Use the SSH Remote Control
de: Verwenden Sie die SSH-Fernbedienung

source: We can open the Bash Shell of Raspberry Pi by applying SSH. Bash is the standard default shell of Linux. The Shell itself is a program written in C that is the bridge linking the customers and Unix/Linux. Moreover, it can help to complete most of the work needed.
de: Wir können die Bash Shell von Raspberry Pi öffnen, indem wir SSH anwenden. Bash ist die Standard-Standard-Shell von Linux. Die Shell selbst ist ein in C geschriebenes Programm, das die Brücke zwischen den Kunden und Unix/Linux bildet. Darüber hinaus kann es helfen, die meisten der erforderlichen Arbeiten zu erledigen.

source: For Linux or/Mac OS X users
de: Für Linux- oder/Mac OS X-Benutzer

source: Go to **Applications**->\ **Utilities**, find the **Terminal**, and open it.
de: Gehen Sie zu **Anwendungen**->\ **Dienstprogramme**, suchen Sie das **Terminal** und öffnen Sie es.

source: Type in **ssh pi@ip_address** . \"pi\" is your username and \"ip_address\" is your IP address. For example:
de: Geben Sie **ssh pi@ip_address** ein. \"pi\" ist Ihr Benutzername und \"ip_address\" ist Ihre IP-Adresse. Beispielsweise:

source: Input \"yes\".
de: Geben Sie \"yes\" ein.

source: Input the passcode and the default password is **raspberry**.
de: Geben Sie den Passcode ein und das Standardpasswort ist **raspberry**.

source: We now get the Raspberry Pi connected and are ready to go to the next step.
de: Wir haben jetzt den Raspberry Pi angeschlossen und können mit dem nächsten Schritt fortfahren.

source: When you input the password, the characters do not display on window accordingly, which is normal. What you need is to input the correct passcode.
de: Wenn Sie das Passwort eingeben, werden die Zeichen nicht entsprechend im Fenster angezeigt, was normal ist. Sie müssen den richtigen Passcode eingeben.

source: For Windows Users
de: Für Windows-Benutzer

source: If you're a Windows user, you can use SSH with the application of some software. Here, we recommend **PuTTY** (You can download from Google).
de: Wenn Sie ein Windows-Benutzer sind, können Sie SSH mit der Anwendung einiger Software verwenden. Hier empfehlen wir **PuTTY** (Sie können von Google herunterladen).

source: Download PuTTY. Open PuTTY and click **Session** on the left tree-alike structure. Enter the IP address of the RPi in the text box under **Host Name (or IP address)** and **22** under **Port** (by default it is 22).
de: PuTTY herunterladen. Öffnen Sie PuTTY und klicken Sie in der linken baumähnlichen Struktur auf **Sitzung**. Geben Sie die IP-Adresse des RPi in das Textfeld unter **Hostname (oder IP-Adresse)** und **22** unter **Port** ein (standardmäßig ist es 22).

source: Click **Open**. Note that when you first log in to the Raspberry Pi with the IP address, there prompts a security reminder. Just click **Yes**.
de: Klicken Sie auf **Öffnen**. Beachten Sie, dass beim ersten Anmelden am Raspberry Pi mit der IP-Adresse eine Sicherheitserinnerung angezeigt wird. Klicken Sie einfach auf **Ja**.

source: When the PuTTY window prompts \"**login as:**\", type in \"**pi**\" (the user name of the RPi), and **password:** \"raspberry\" (the default one, if you haven't changed it).
de: Wenn das PuTTY-Fenster \"**login as:**\" auffordert, geben Sie \"**pi**\" (den Benutzernamen des RPi) und **password:** \"raspberry\" ( die Standardeinstellung, wenn Sie sie nicht geändert haben).

source: Here, we get the Raspberry Pi connected and it is time to conduct the next steps.
de: Hier bekommen wir den Raspberry Pi angeschlossen und es ist Zeit, die nächsten Schritte durchzuführen.
