Repository: sunfounder/SunFounder_PiCar-S
Catalog: docs/locale/*/LC_MESSAGES/light_following.po
Languages: de, ja

source: Light Following
de: Licht folgt
ja: ライトフォロワー

source: How It Works
de: Wie es funktioniert
ja: 動作原理

source: The light follower module detects light sources in the surroundings, and transfers the data to the processor. The processor analyzes the data and finds the direction of the light resource, so it will send a command to control the movement of the front and rear wheels to approach the resource.
de: Das Lichtfolgermodul erkennt Lichtquellen in der Umgebung und überträgt die Daten an den Prozessor. Der Prozessor analysiert die Daten und findet die Richtung der Lichtressource, sodass er einen Befehl sendet, um die Bewegung der Vorder- und Hinterräder zu steuern, um sich der Ressource zu nähern.
ja: ライトフォロアモジュールは周囲の光源を検出し、データをプロセッサに転送する。プロセッサはデータを分析し、光源の方向を見つけるため、前輪と後輪の動きを制御してリソースにアプローチするコマンドを送信する。

source: Procedures
de: Verfahren
ja: 手順

source: **Step 1 Assembly**
de: **Schritt 1 Montage**
ja: **ステップ1 組み立て**

source: Connect the light follower to the Sensor Connector with **M3*10 screws** and **M3 nuts**, and then assemble them to the car with two **M3*10 screws** and two **M3 nuts**. You're suggested to hold the nuts underneath with your fingers.
de: Verbinden Sie den Lichtfolger mit **M3*10-Schrauben** und **M3-Muttern** mit dem Sensoranschluss und montieren Sie sie dann mit zwei **M3*10-Schrauben** und zwei **M3-Muttern** am Fahrzeug . Es wird empfohlen, die Nüsse darunter mit den Fingern zu halten.
ja: **M3*10ネジ** と **M3ナット** を使用してライトフォロアをセンサーコネクタに接続し、2つの **M3*10ネジ** と2つの **M3ナット** を使ってそれらを車に組み立てる。指でナットを下に持ってください。

source: **Step 2 Wiring**
de: **Schritt 2 Verkabelung**
ja: **ステップ2 配線**

source: Connect the light follower to the Robot HATS with a 5-pin anti-reverse cable as shown below.
de: Verbinden Sie den Lichtfolger wie unten gezeigt mit einem 5-poligen Anti-Reverse-Kabel mit dem Robot HATS.
ja: 以下に示すように、5ピンのアンチリバースケーブルでライトフォロアをロボットHATSに接続する。

source: You may wonder why we connect 5V to 3.3. Well, since the working voltage of the STM8 chip on the light follower is 2.7-5.5V, we can connect it to 3.3V here. **DO NOT** connect 5V to 5V! All the analog ports on the Robot HATS are led from the PCA8591, which is powerd by 3.3V. Therefore, if the voltage is between 3.3V-5V, the output value will always be 255, thus the PCA8591 may be damaged if connected to 5V. Remember to connect to **3.3V**.
de: Sie fragen sich vielleicht, warum wir 5V an 3.3 anschließen. Nun, da die Arbeitsspannung des STM8-Chips auf dem Lichtfolger 2,7-5,5 V beträgt, können wir ihn hier an 3,3 V anschließen. **NICHT** 5V an 5V anschließen! Alle analogen Ports des Robot HATS werden vom PCA8591 geführt, der mit 3,3 V gespeist wird. Wenn die Spannung zwischen 3,3V-5V liegt, beträgt der Ausgangswert daher immer 255, daher kann der PCA8591 beschädigt werden, wenn er an 5V angeschlossen wird. Denken Sie daran, an **3.3V** anzuschließen.
ja: なぜ5Vを3.3に接続するのか質問を持っているかもしれない。さて、ライトフォロア上のSTM8チップの動作電圧は2.7-5.5Vなので、ここで3.3Vに接続できる。5Vを5Vに **接続しない** でください！Robot HATSのすべてのアナログポートは3.3Vで動作するPCA8591から導かれる。したがって、電圧が3.3V〜5Vの場合、出力値は常に255になるため、5Aに接続するとPCA8591が損傷する恐れがある。必ず **3.3V** に接続してください。

source: The wiring is shown as below:
de: Die Verdrahtung ist wie folgt dargestellt:
ja: 配線は次の通りである：

source: **Step 3 Test**
de: **Schritt 3 Test**
ja: **ステップ3 テスト**

source: Let’s test the light follower first.
de: Lassen Sie uns zuerst den Lichtfolger testen.
ja: まずライトフォロワーをテストしよう。

source: Expose the phototransistors to the light spot of the flashlight. When you increase the light intensity, more LEDs light up, and the output values decrease.
de: Setzen Sie die Fototransistoren dem Lichtfleck der Taschenlampe aus. Wenn Sie die Lichtintensität erhöhen, leuchten mehr LEDs und die Ausgangswerte sinken.
ja: フォトトランジスタを懐中電灯の光点に当てる。光量を増やすと、より多くのLEDが点灯し、出力値が減少する。

source: Here we can rotate the blue adjustable resistor to change the values under the same light luminance. The best status is as follows:
de: Hier können wir den blauen einstellbaren Widerstand drehen, um die Werte bei gleicher Lichthelligkeit zu ändern. Der beste Status ist wie folgt:
ja: ここで、青色の調整可能な抵抗器を回転させて、同じ光の輝度で値を変更できる。最良のステータスは次のとおりである：

source: When there is only one LED lights up, the output value is 255
de: Wenn nur eine LED leuchtet, beträgt der Ausgangswert 255
ja: LEDが1つしか点灯していない場合、出力値は255である。

source: When the light is the brightest and all the LED light up, the output value is about 10-25.
de: Wenn das Licht am hellsten ist und alle LEDs leuchten, beträgt der Ausgabewert etwa 10-25.
ja: ライトが最も明るく、すべてのLEDが点灯する場合、出力値は約10〜25である。

source: **Step 4. Get on the road!**
de: **Schritt 4. Mach dich auf den Weg!**
ja: **ステップ4 旅に出よう！**

source: The car will enter the light following configuration mode when we run the code above. It will keep turning to the right in a circle to gather the information of light condition in different directions. So just place the car in an open field and wait.
de: Das Auto wechselt in den Lichtkonfigurationsmodus, wenn wir den obigen Code ausführen. Es dreht sich weiter im Kreis nach rechts, um Informationen über die Lichtverhältnisse in verschiedene Richtungen zu sammeln. Also einfach das Auto auf ein offenes Feld stellen und warten.
ja: 上記のコードを実行すると、車は次の light followingモードに入る。円を描くように右に曲がり続け、さまざまな方向の光の状態に関する情報を収集する。車をより広い場所に置いて待ってください。

source: When the calibration is done, the car will stop temporarily. Shine a flashlight on the light follower module, and the car will just follow the light spot as you moves it.
de: Wenn die Kalibrierung abgeschlossen ist, wird das Auto vorübergehend anhalten. Leuchten Sie mit einer Taschenlampe auf das Lichtfolgermodul, und das Auto folgt einfach dem Lichtpunkt, wenn Sie es bewegen.
ja: 補正が完了すると、車は一時停止する。ライトフォロアモジュールの電灯を照らすと、車は移動するときにライトスポットに追従する。

source: Code Explanation for light_follower.py
de: Code-Erklärung für light_follower.py
ja: － light_follower.pyのコードの説明

source: **Whole Work Flow**
de: **Gesamter Arbeitsablauf**
ja: **ワークフロー全体**

source: Light-sensitive sensors need to be calibrated before actual use because of complex light conditions in the environment. It gathers the information of the ambient light luminance. The car can follow light only when the light source is brighter than the surroundings.
de: Aufgrund der komplexen Lichtverhältnisse in der Umgebung müssen lichtempfindliche Sensoren vor dem tatsächlichen Einsatz kalibriert werden. Es sammelt die Informationen über die Helligkeit des Umgebungslichts. Das Auto kann dem Licht nur folgen, wenn die Lichtquelle heller ist als die Umgebung.
ja: 環境の光条件が複雑なので、感光センサーは実際に使用する前に補正する必要がある。環境光の輝度の情報を収集する。光源が周囲より明るい場合のみ、車は光に追従できる。

source: Here write two main functions/modules including light following calibration and light following in the main program.
de: Schreiben Sie hier zwei Hauptfunktionen/Module einschließlich Lichtnachkalibrierung und Lichtnachführung in das Hauptprogramm.
ja: ここでは、補正後のライトとメインプログラム内のライトフォローを含む2つの主要な関数/モジュールを書き込む。

source: **Subflow of Light Follower Calibration Function**
de: **Unterfluss der Lichtfolger-Kalibrierungsfunktion**
ja: **ライトフォロア補正機能のサブフロー**

source: We need to configure three light-sensitive components separately, so we set three lists to store the values in A0, A1, and A2 collected for multiple times. Then pick out the minimum values, which are the output analog values in the brightest conditions.
de: Wir müssen drei lichtempfindliche Komponenten separat konfigurieren, also legen wir drei Listen fest, um die Werte in A0, A1 und A2 zu speichern, die mehrmals gesammelt wurden. Wählen Sie dann die Minimalwerte aus, die die ausgegebenen Analogwerte bei den hellsten Bedingungen sind.
ja: 3つの感光性コンポーネントを個別に構成する必要があるため、何回に収集されたA0、A1、とA2に値を保存する3つのリストを設定する。次に、最も明るい条件での出力アナログ値である最小値を選ぶ。

source: Since the light source we use is much brighter than the ambient light, we should take the output values in the brightest conditions as reference.
de: Da die von uns verwendete Lichtquelle viel heller ist als das Umgebungslicht, sollten wir die Ausgangswerte bei den hellsten Bedingungen als Referenz nehmen.
ja: 使用する光源は環境光よりもはるかに明るいため、最も明るい条件での出力値を参照として使用してください。

source: Besides, we should set a threshold value - when the gap between the collected value of the light source and that of the environment is beyond the threshold, trigger the value switching to 0 or 1. Here we use [0,0,0] to represent the three photoresistors’ status when they are not triggered. "0" will become "1" when the value detected of the corresponding photoresistor is higher than the threshold. Thus we can set the related action of the car according to the three-element list.
de: Außerdem sollten wir einen Schwellenwert festlegen - wenn die Lücke zwischen dem erfassten Wert der Lichtquelle und dem der Umgebung den Schwellenwert überschreitet, lösen Sie die Wertumschaltung auf 0 oder 1 aus. Hier verwenden wir [0,0,0] bis stellen den Status der drei Fotowiderstände dar, wenn sie nicht ausgelöst werden. Aus "0" wird "1", wenn der erfasste Wert des entsprechenden Fotowiderstands höher als der Schwellenwert ist. Somit können wir die zugehörige Aktion des Autos gemäß der Drei-Elemente-Liste festlegen.
ja: さらに、しきい値を設定する必要がある-収集された光源の値と環境の値のギャップがしきい値を超えた場合、値を0または1に設定する。ここでは、[0,0,0]を使用して、トリガーされていないときの3つのフォトレジスターのステータスを表す。対応するフォトレジスタの検出値がしきい値よりも高い場合、「0」は「1」になる。したがって、3つの要素のリストに従って車の関連アクションを設定できる。

source: If there is light detected, the car will move and follow it; if there is no light detected, the car will stop temporarily and keep turning to detect in a circle.
de: Wenn Licht erkannt wird, bewegt sich das Auto und folgt ihm; Wenn kein Licht erkannt wird, hält das Auto vorübergehend an und dreht sich weiter, um im Kreis zu erkennen.
ja: 光が検出された場合、車は動き、それに追跡する。光が検出されない場合、車は一時的に停止し、旋回を続けて円を検出する。

source: **Subflow of Light Following Function**
de: **Subflow of Light-Following-Funktion**
ja: **ライトフォロアー機能のサブフロー**

source: The light follower includes three phototransistors, thus its status list is composed of three elements which represent 8 statuses (based on permutation and combination). And here we need to set related responses to these statuses.
de: Der Lichtfolger enthält drei Fototransistoren, daher besteht seine Statusliste aus drei Elementen, die 8 Status repräsentieren (basierend auf Permutation und Kombination). Und hier müssen wir entsprechende Antworten auf diese Status festlegen.
ja: ライトフォロワーには3つのフォトトランジスターが含まれるため、そのステータスリストは8つのステータスを表す3つの要素で構成される（順列と組み合わせに基づく）。ここでは、これらのステータスに関連する応答を設定する必要がある。

source: The three elements show the status of the three probes: 1 represents light detected, and 0, for none. For example, [1,0,0] shows that light is detected only by the left probe, meaning th light source is at the left of the car, thus setting the car’s response action as turning left; [1,1,0] means that light is detected on the left and central probes, thus its response action should be set turning left too; and set it as turning right the same way according to the corresponding status. When there is no light detected, the status is [0,0,0], so we set the response action to stop and return to the standby mode.
de: Die drei Elemente zeigen den Status der drei Sonden: 1 steht für Licht erkannt und 0 für keine. [1,0,0] zeigt beispielsweise, dass Licht nur von der linken Sonde erfasst wird, was bedeutet, dass sich die Lichtquelle links vom Auto befindet, wodurch die Reaktion des Autos auf Linksabbiegen eingestellt wird; [1,1,0] bedeutet, dass Licht an der linken und mittleren Sonde erkannt wird, daher sollte ihre Reaktion auch linksdrehend eingestellt werden; und stellen Sie es entsprechend dem entsprechenden Status auf die gleiche Weise als rechts abbiegend ein. Wenn kein Licht erkannt wird, ist der Status [0,0,0], also setzen wir die Reaktionsaktion auf Stopp und kehren in den Standby-Modus zurück.
ja: 3つの要素は3つのプローブのステータスを示す：1は検出された光を表し、0は検出されなかったことを表す。たとえば、[1,0,0]は光が左側のプローブによってのみ検出されることを示し、つまり、光源が車の左側にあり、車の応答アクションを左折として設定する。 [1,1,0]は光が左側と中央のプローブで検出されることを意味するため、その応答アクションも左折に設定する必要がある。対応するステータスに従って同様に右折するように設定する。光が検出されない場合、ステータスは[0,0,0]であるため、応答アクションを停止してスタンバイモードに戻るように設定する。

source: Here, we need to set another variable – the steering angle – to distinguish between the large-angle and small-angle turning. If the light is at the central left side (status [1,1,0]), we should apply a small-angle turning; if the light is at the edge of the left side (status [1,0,0]), we should apply a large-angle turning.
de: Hier müssen wir eine weitere Variable – den Lenkwinkel – einstellen, um zwischen dem Großwinkel- und Kleinwinkel-Drehen zu unterscheiden. Befindet sich das Licht auf der mittleren linken Seite (Status [1,1,0]), sollten wir eine kleine Winkeldrehung anwenden; befindet sich das Licht am Rand der linken Seite (Status [1,0,0]), sollten wir eine große Winkeldrehung anwenden.
ja: ここでは、大角度と小角度の回転を区別するために、別の変数（ステアリング角度）を設定してください。ライトが左側の中心にある場合（ステータス[1,1,0]）、小角度の回転を適用する必要がある。ライトが左側の端にある場合（ステータス[1,0,0]）、大きな角度の回転を適用する。

source: Functions Explanation
de: Funktionen Erklärung
ja: 機能説明

source: To understand the code, take the software subflows above for reference.
de: Um den Code zu verstehen, verwenden Sie die obigen Software-Unterabläufe als Referenz.
ja: コードを理解するには、上記のソフトウェアサブフローを参考にしてください。

source: Three Python modules are used in the code including the imported **light_follower_module**, **front_wheels**, and **back_wheel** previously. They are drivers for this kit, respectively for light following, front wheels and rear wheels.
de: Im Code werden drei Python-Module verwendet, darunter die zuvor importierten **light_follower_module**, **front_wheels** und **back_wheel**. Sie sind Treiber für diesen Bausatz, bzw. für Lichtfolge, Vorderräder und Hinterräder.
ja: 以前にインポートされた **light_follower_module**、**front_wheels**、と **back_wheel** を含む3つのPythonモジュールがコードに使われる。これらはこのキットのドライバーであり、それぞれライトフォロー、前輪と後輪となっている。

source: The related classes have been defined here. When the modules are applied to use, objects will be created for related classes, and different parts of hardware will be driven by calling a function by the class object.
de: Die zugehörigen Klassen wurden hier definiert. Wenn die Module zur Verwendung angewendet werden, werden Objekte für verwandte Klassen erstellt, und verschiedene Teile der Hardware werden durch Aufrufen einer Funktion durch das Klassenobjekt gesteuert.
ja: 関連クラスはここで定義されている。モジュールを適用して使用すると、関連するクラスのオブジェクトが作成され、ハードウェアのさまざまな部分がクラスオブジェクトによる関数を呼び出すことによって駆動される。

source: For example, for the light following module, we create an object named **lf**:
de: Für das folgende Lichtmodul erstellen wir beispielsweise ein Objekt namens **lf**:
ja: たとえば、ライトフォローモジュールの場合、**lf** という名前のオブジェクトを作成する：

source: Then we can call the function by a class object.
de: Dann können wir die Funktion von einem Klassenobjekt aufrufen.
ja: それからクラスオブジェクトによって関数を呼び出す。

source: This function **read_analog()** will return a list with three elements, which stores the detected analog values of three probes. Here we use **A0 = lf.read_analog()[0]**, **A1 = lf.read_analog()[1]**, and **A2 = lf.read_analog()[2]** to store three elements of returned value separately into the variables A0-A2.
de: Diese Funktion **read_analog()** gibt eine Liste mit drei Elementen zurück, die die erfassten Analogwerte von drei Sonden speichert. Hier verwenden wir **A0 = lf.read_analog()[0]**, **A1 = lf.read_analog()[1]** und **A2 = lf.read_analog()[2]** zum Speichern drei Elemente des zurückgegebenen Werts getrennt in die Variablen A0-A2.
ja: この関数 **read_analog()** は、3つのプローブの検出されたアナログ値を保存する3つの要素のリストを返す。ここでは、**A0=lf.read_analog()[0]**, **A1=lf.read_analog()[1]** と **A2=lf.read_analog()[2]** を使用して、戻り値の3つの要素を変数A0-A2に個別に保存する 。

source: A **for()** loop is used here cycling 10 times, that is the car will acquire the analog values ten times when the car drives in a circle under the calibration mode. The minimum values will be taken as reference here. If you need more samples, just increase the times of the loop.
de: Eine **for()**-Schleife wird hier 10 Mal durchlaufen, d. h. das Auto erfasst die analogen Werte zehn Mal, wenn das Auto im Kalibrierungsmodus im Kreis fährt. Die Mindestwerte werden hier als Referenz genommen. Wenn Sie mehr Samples benötigen, erhöhen Sie einfach die Zeiten des Loops.
ja: ここでは **for()** ループを10回使用する。つまり、補正モードで車が円を描くように走行すると、車はアナログ値を10回取得する。ここでは、最小値を参考している。より多くのサンプルが必要な場合は、ループの回数を増やしてください。

source: Store the detected values to a list in each loop by the **env0_list.append(A0)** function. When the loop ends, the built-in list function **reference[0] = min(env0_list)** in Python will pick out the minimum in the list.
de: Speichern Sie die erkannten Werte in jeder Schleife mit der Funktion **env0_list.append(A0)** in einer Liste. Wenn die Schleife endet, wählt die eingebaute Listenfunktion **reference[0] = min(env0_list)** in Python das Minimum in der Liste aus.
ja: **env0_list.append(A0)** 関数によって、検出された値を各ループのリストに保存する。ループが終了すると、Pythonの組み込みリスト関数 **reference[0] = min(env0_list)** がリストの最小値を選ぶ。

source: This is to read the status of the module, which will return a 3-element list. This function is used to solve the possible problem caused by brightness-adjustable flashlights. They blink repeatedly due to brightness change by PWM method, so we add this function to the driver library to prevent the car from moving and stopping repeatedly when the light source lights up and goes out quickly or changes luminance by ON/OFF ratio.
de: Dies dient zum Lesen des Status des Moduls, das eine 3-Elemente-Liste zurückgibt. Diese Funktion wird verwendet, um das mögliche Problem zu lösen, das durch helligkeitsregulierbare Taschenlampen verursacht wird. Sie blinken wiederholt aufgrund der Helligkeitsänderung durch die PWM-Methode. Daher fügen wir diese Funktion der Treiberbibliothek hinzu, um zu verhindern, dass sich das Auto wiederholt bewegt und stoppt, wenn die Lichtquelle aufleuchtet und schnell erlischt oder die Leuchtdichte durch das EIN/AUS-Verhältnis ändert.
ja: この目的は3要素のリストを返すモジュールのステータスを読み取ることである。この機能は輝度が調節可能な懐中電灯によって引き起こされる問題を解決するために使用される。PWM方式による輝度変化で繰り返し点滅するので、この機能をドライバーライブラリーに追加し、光源が急に消灯したり、ON/OFFの比率で輝度が変化したりしても、車が何度も動いたり止まったりしないようにする。

source: Function for front wheels steering. The main program will call this function if the front wheels are applied for steering. The parameter is the turning angle.
de: Funktion für die Vorderradlenkung. Das Hauptprogramm ruft diese Funktion auf, wenn die Vorderräder zum Lenken verwendet werden. Der Parameter ist der Drehwinkel.
ja: 前輪ステアリング機能。前輪がステアリングに適用されている場合、メインプログラムはこの関数を呼び出す。パラメータは回転角度となっている。

source: **bw.forward()**
de: **bw.vorwärts()**

source: Here we need two functions for rear wheels. The first function is to control the rotating direction as forward (the function for backwards is **bw.backward()**). The second one is to set the rotating speed of the wheels; the parameter is the speed value (range: 0-100). The bigger the parameter is, the faster the wheel rotates.
de: Hier benötigen wir zwei Funktionen für Hinterräder. Die erste Funktion besteht darin, die Drehrichtung vorwärts zu steuern (die Funktion für rückwärts ist **bw.backward()**). Die zweite Möglichkeit besteht darin, die Drehgeschwindigkeit der Räder einzustellen; der Parameter ist der Geschwindigkeitswert (Bereich: 0-100). Je größer der Parameter ist, desto schneller dreht sich das Rad.
ja: 後輪には2つの機能が必要である。最初の関数は回転方向を順方向に制御する（逆方向の関数は **bw.backward()** である）。2つ目は車輪の回転速度を設定すること。パラメータは速度の値である（範囲：0-100）。パラメータが大きければ大きいほど、ホイールの回転が速くなる。
