Repository: sunfounder/SunFounder_PiCar-S
Catalog: docs/locale/*/LC_MESSAGES/line_following.po
Languages: de, ja

source: Line Following
de: Linie folgt
ja: ラインフォロー

source: How it works
de: Wie es funktioniert
ja: 動作原理

source: The line follower detects lines in the surrounding environment, and transfers the data to the processor. The processor analyzes the data, and sends a command to control the movement of front wheels and rear wheels.
de: Der Line Follower erkennt Linien in der Umgebung und überträgt die Daten an den Prozessor. Der Prozessor analysiert die Daten und sendet einen Befehl, um die Bewegung der Vorder- und Hinterräder zu steuern.
ja: ラインフォロワーは周囲の環境でラインを検出し、データをプロセッサーに転送する。プロセッサはデータを分析し、前輪と後輪の動きを制御するコマンドを送信する。

source: Procedures
de: Verfahren
ja: 手順

source: **Step 1 Assembly**
de: **Schritt 1 Montage**
ja: **ステップ1 組み立て**

source: Connect the light follower to the Sensor Connector with **M3*10 screws** and **M3 nuts**, and then assemble them to the car with two **M3*10 screws** and two **M3 nuts**. You're suggested to hold the nuts underneath with your fingers.
de: Verbinden Sie den Lichtfolger mit **M3*10-Schrauben** und **M3-Muttern** mit dem Sensoranschluss und montieren Sie sie dann mit zwei **M3*10-Schrauben** und zwei **M3-Muttern** am Fahrzeug . Es wird empfohlen, die Nüsse darunter mit den Fingern zu halten.
ja: **M3*10ネジ*8と**M3ナット**を使用してライトフォロアをセンサーコネクタに接続し、2つの**M3*10ネジ**と2つの**M3ナット**を使ってそれらを車に組み立てる。指でナットを下に持ってください。

source: **Step 2 Wiring**
de: **Schritt 2 Verkabelung**
ja: **ステップ2 配線**

source: Connect the light follower to the Robot HATS with a 5-pin anti-reverse cable as shown below.
de: Verbinden Sie den Lichtfolger wie unten gezeigt mit einem 5-poligen Anti-Reverse-Kabel mit dem Robot HATS.
ja: 以下に示すように、4ピンのアンチリバースケーブルでラインフォロアモジュールをロボットHATSに接続する。

source: **Step 3 Test**
de: **Schritt 3 Test**
ja: **ステップ3 テスト**

source: Get into the directory example:
de: Rufen Sie das Verzeichnisbeispiel auf:
ja: ディレクトリの例をチェックする：

source: Check whether any i2c device is recognized or not via i2c-tools
de: Überprüfen Sie, ob ein i2c-Gerät über i2c-Tools erkannt wird oder nicht
ja: i2c-toolsを介してi2cデバイスが認識されているかどうかを確認する

source: We can see 11 is the line follower’s i2c address. If it is not shown, it proves your wiring is not correct and the i2c communication with Raspberry Pi fails too. You need to check the wiring before the next step.
de: Wir können sehen, dass 11 die i2c-Adresse des Linienfolgers ist. Wenn es nicht angezeigt wird, beweist dies, dass Ihre Verkabelung nicht korrekt ist und auch die i2c-Kommunikation mit dem Raspberry Pi schlägt fehl. Sie müssen die Verkabelung vor dem nächsten Schritt überprüfen.
ja: 11がラインフォロワーのi2cアドレスであることが判明した。表示されない場合は、配線が正しくなく、Raspberry Piとのi2c通信も失敗したことを示す。次のステップの前に配線を確認する必要がある。

source: Run the test code.
de: Führen Sie den Testcode aus.
ja: テストコードを実行する。

source: For the better working of line following module, we should adjust its sensitivity. The steps are as follows:
de: Für eine bessere Funktion des Zeilenfolgemoduls sollten wir seine Empfindlichkeit anpassen. Die Schritte sind wie folgt:
ja: ラインフォローモジュールをより適切に機能させるために、感度を調整してください。手順は次のとおりである：

source: Place the module on the white surface, read the value ; place it on balck surface, and read value.
de: Legen Sie das Modul auf die weiße Fläche, lesen Sie den Wert ab; Legen Sie es auf eine schwarze Oberfläche und lesen Sie den Wert ab.
ja: モジュールを白い表面に置き、値を読み取る。白い表面に置き、値を読み取る。

source: Calculate the difference, rotate potentiometer on the line following module toward the clockwise and anticlockwise till the diffence reaches up to the maximum. Now the debugging is finished.
de: Berechnen Sie die Differenz, drehen Sie das Potentiometer am Linienfolgemodul im Uhrzeigersinn und gegen den Uhrzeigersinn, bis die Differenz das Maximum erreicht. Jetzt ist das Debuggen abgeschlossen.
ja: 差を計算し、最大値になるまで、次のモジュールのポテンショメーターを時計回りと反時計回りに回転させる。これでデバッグは完了した。

source: **Step 4 Starts Running!**
de: **Schritt 4 beginnt zu laufen!**
ja: **ステップ4 実行を開始する！**

source: Run the line follower code
de: Führen Sie den Zeilenfolger-Code aus
ja: ラインフォロワーコードを実行する

source: A prompt of calibration will be printed on the screen when the program starts to run. We will calibrate the module on a white surface first: place all the five probes of the line follower above a white board. The prompt of completed calibration will be printed on the screen a few seconds later. Then let’s move on to calibration on black line. Also the prompt of starting is printed on the screen, and then place all the probes above the black lines. And the prompt of calibration completed will be printed on the screen a few seconds later.
de: Eine Aufforderung zur Kalibrierung wird auf dem Bildschirm gedruckt, wenn das Programm gestartet wird. Wir kalibrieren das Modul zunächst auf einer weißen Fläche: Platzieren Sie alle fünf Sonden des Linienfolgers über einer weißen Tafel. Die Aufforderung zur abgeschlossenen Kalibrierung wird einige Sekunden später auf dem Bildschirm gedruckt. Fahren wir dann mit der Kalibrierung auf der schwarzen Linie fort. Auch die Startaufforderung wird auf dem Bildschirm gedruckt, und dann alle Sonden über den schwarzen Linien platzieren. Und die Aufforderung zum Abschluss der Kalibrierung wird einige Sekunden später auf dem Bildschirm gedruckt.
ja: プログラムの実行が開始されると、補正のヒントが画面に表示される。まずは白い表面でモジュールを補正する。ラインフォロアの5つのプローブすべてを白いボードの上に配置する。完了した補正のプロンプトが数秒後に画面に表示される。次に、黒い線の補正に進む。また、開始のプロンプトが画面に表示され、すべてのプローブが黒い線の上に配置される。完了した補正のプロンプトが数秒後に画面に表示される。

source: When the module calibration is all completed, we can run the car then. Place the PiCar-S with probes above the black line on the white board, and then it will go forward following the line itself.
de: Wenn die Modulkalibrierung abgeschlossen ist, können wir das Auto dann fahren. Platzieren Sie das PiCar-S mit den Sonden über der schwarzen Linie auf der weißen Tafel, und dann fährt es der Linie selbst folgend vorwärts.
ja: モジュールの補正がすべて完了すると、車を走らせることができる。プローブ付きのPiCar-Sをホワイトボードの黒い線の上に置くと、線自体に従って進む。

source: How to make a track for line following
de: So erstellen Sie einen Track für die Linienverfolgung
ja: ラインフォローの追跡を作る方法

source: To make a track for the car to follow a black line, you need to prepare the following materials:
de: Um eine Spur für das Auto zu erstellen, die einer schwarzen Linie folgt, müssen Sie die folgenden Materialien vorbereiten:
ja: 車が黒い線をたどるように追跡を作成するには、次の材料を準備しなければならない：

source: A large sheet of paper, a roll of black tape (as black lines), a hard card board (the size depending on the size of the track) or a flat surface like the floor or desk.
de: Ein großes Blatt Papier, eine Rolle schwarzes Klebeband (als schwarze Linien), ein Hartkarton (die Größe hängt von der Größe der Schiene ab) oder eine ebene Fläche wie Boden oder Schreibtisch.
ja: 大きな紙、黒いテープのロール（黒い線）、ハードカードボード（サイズはトラックのサイズによって異なる）、または床や机などの平らな面。

source: 1. Spread the paper out smoothly on the hard board, and paste on the board or flat surface.
de: 1. Breiten Sie das Papier glatt auf der Hartfaserplatte aus und kleben Sie es auf die Platte oder eine ebene Oberfläche.
ja: 1. 硬い板の上で紙を滑らかに広げ、板または平らな面に貼り付ける。

source: Paste the tape on the paper.
de: Kleben Sie das Klebeband auf das Papier.
ja: テープを紙に貼り付ける。

source: Rules for making:
de: Regeln für die Herstellung:
ja: 作成のルール：

source: Width of the black line: about 18-30mm, nearly the distance between
de: Breite der schwarzen Linie: ca. 18-30mm, fast der Abstand zwischen
ja: 黒い線の幅：約18〜30mm、2つのプローブ間の距離、2つの隣接していないプローブ

source: two probes, no more than the minimum distance of two nonadjacent probes
de: zwei Sonden, nicht mehr als der Mindestabstand von zwei nicht benachbarten Sonden
ja: の最小距離以下

source: The gap between two lines: more than 125mm, which is the width of the
de: Die Lücke zwischen zwei Linien: mehr als 125 mm, das ist die Breite des
ja: 2本の線の間隔：モジュール全体の幅である125mm以上で、2本の線を同時に検出した

source: whole module, to prevent the car from getting confused when detecting two lines at the same time.
de: gesamtes Modul, um zu verhindern, dass das Auto beim gleichzeitigen Erkennen von zwei Linien verwirrt wird.
ja: ときに車が混乱することを防ぐ。

source: The semidiameter of curves: more than 138mm. When the front wheels
de: Der Halbdurchmesser der Kurven: mehr als 138 mm. Wenn die Vorderräder
ja: 曲線の直径：138mm以上。前輪が左または右に45度回転する場合、車が曲がる経路の

source: turn left or right 45 degrees, the semidiameter of the path by which the car turns is equal to the wheelbase (the distance between the center of the front wheels and rear wheels). The car won't be able to turn and pass the curve smoothly if the semidiameter of the curve is too small.
de: 45 Grad nach links oder rechts abbiegen, der Halbdurchmesser des Wegs, um den sich das Auto dreht, ist gleich dem Radstand (der Abstand zwischen der Mitte der Vorderräder und der Hinterräder). Wenn der Halbdurchmesser der Kurve zu klein ist, wird das Auto nicht in der Lage sein, zu wenden und die Kurve reibungslos zu passieren.
ja: 半径はホイールベース（前輪の中心と後輪の中心間の距離）と等しくなる。カーブの半径が小さすぎると、車はカーブをスムーズに曲がったり、通過したりことはできない。

source: A track sample is shown as below (the original map file can be found under folder **map** in **github**):
de: Ein Track-Beispiel ist wie folgt dargestellt (die Original-Kartendatei befindet sich im Ordner **map** in **github**):
ja: 追跡のサンプルを以下に示す（元のマップファイルは**github**のフォルダー**マップ**の下にある）：

source: Code Explanation of line_follower.py
de: Code-Erklärung von line_follower.py
ja: line_follower.pyのコードの説明

source: **Whole Work Flow**
de: **Gesamter Arbeitsablauf**
ja: **ワークフロー全体**

source: Considering the interference of negative environment factors, we need to calibrate the line follower sensor before actual use.
de: In Anbetracht der Beeinflussung durch negative Umgebungsfaktoren müssen wir den Linienfolgersensor vor der tatsächlichen Verwendung kalibrieren.
ja: マイナスの環境要因の干渉を考慮して、実際に使用する前にラインフォロワーセンサーを補正しなければならない。

source: Here two main functions including the line follower calibration and line following are included in the main program.
de: Hier sind zwei Hauptfunktionen einschließlich der Linienfolgerkalibrierung und der Linienfolge im Hauptprogramm enthalten.
ja: ここでは、ラインフォロワー補正とラインフォロイングを含む2つの主要な機能がメインプログラムに含まれている。

source: **Subflow of Line Follower Calibration Function**
de: **Subflow der Line Follower-Kalibrierungsfunktion**
ja: **ラインフォロワー補正機能のサブフロー**

source: When we run the line follower configuration, we will start from white color, then black color, which is more like the upper limit and lower limit of the sensor. Then we take the average value of black and white as reference value: if the detected value is higher than the reference, it should be white; if the detected is lower than the reference, it should be black. We will show the five detectors’ status by 5 elements [0,0,0,0,0].
de: Wenn wir die Line-Follower-Konfiguration ausführen, beginnen wir mit weißer Farbe und dann mit schwarzer Farbe, was eher der Ober- und Untergrenze des Sensors entspricht. Dann nehmen wir den Durchschnittswert von Schwarz und Weiß als Referenzwert: Wenn der erfasste Wert höher als der Referenzwert ist, sollte er Weiß sein; Wenn der erkannte Wert niedriger als der Referenzwert ist, sollte er schwarz sein. Wir zeigen den Status der fünf Detektoren durch 5 Elemente [0,0,0,0,0] an.
ja: ラインフォロア構成を実行するときは、センサーの上限と下限に近い、白色、次に黒色から始める。それから黒と白の平均値を基準値として使用し、検出された値が基準よりも高い場合、白でなければならない。検出された値が参照よりも低い場合は、黒になる。5つの検出器のステータスを5つの要素[0,0,0,0,0]で示す。

source: **Subflow of Line Following Function**
de: **Unterfluss der Zeilenfolgefunktion**
ja: **ライン追跡機能のサブフロー**

source: In the line following function, we set the turning angle of the servo in different levels according to the detection results of the probes. If the line in front of the car is detected as a small curve, then the car will turn a small angle; if it is a big one, the car will turn a large angle. Thus, here we set four angle-turning constants: a_step, b_step, c_step, and d_step.
de: In der Zeilenfolgefunktion stellen wir den Drehwinkel des Servos in verschiedenen Stufen entsprechend den Erkennungsergebnissen der Sonden ein. Wenn die Linie vor dem Auto als kleine Kurve erkannt wird, dreht das Auto in einem kleinen Winkel; wenn es ein großes ist, wird das Auto einen großen Winkel einschlagen. Daher setzen wir hier vier Winkeldrehkonstanten: a_step, b_step, c_step und d_step.
ja: ラインフォロー機能では、プローブの検出結果に応じてサーボの回転角度を異なるレベルに設定する。車の前の線が小さなカーブとして検出された場合、車は小さな角度で曲がる。大きいと車は大きい角度で曲がる。したがって、ここでは、a_step、b_step、c_step、d_stepの4つの角度回転定数を設定する。

source: When the car moves forward originally, the servo is in 90 degrees. To drive the car to turn left, the servo should be in 90+step degrees; to turn right, the servo should be in 90-step degrees.
de: Wenn sich das Auto ursprünglich vorwärts bewegt, befindet sich das Servo in 90 Grad. Um das Auto nach links zu fahren, sollte das Servo in 90+Schritten stehen; um nach rechts zu drehen, sollte das Servo in 90-Schritten stehen.
ja: もともと車が前進するとき、サーボは90度である。車を運転して左折するには、サーボを90度以上の角度にしなければならない。右折するには、サーボは90ステップの角度でなければならない。

source: There is a special case: if the car runs off the track, and all the probes cannot detect the black lines any more, then it will continue the program below.
de: Es gibt einen Sonderfall: Wenn das Auto von der Strecke abfährt und alle Sonden die schwarzen Linien nicht mehr erkennen können, wird das untenstehende Programm fortgesetzt.
ja: 特別な場合もある：車がコースから外れ、すべてのプローブが黒い線を検出できなくなった場合、以下のプログラムが続行される。

source: In some case, especially when the car turns in a direction when the semi diameter of the curve is very small (1), the car may run out of the track and cannot detect any black line (2). If there is no response program in such case, the car will be unable to follow the line again. Thus we set the response program to let the car move backwards in the opposite direction (3), and then turn back to the original direction until a black line is detected again and move forward (4).
de: In einigen Fällen, insbesondere wenn das Auto in eine Richtung fährt, in der der Halbdurchmesser der Kurve sehr klein ist (1), kann das Auto aus der Spur fahren und keine schwarze Linie erkennen (2). Wenn in diesem Fall kein Reaktionsprogramm vorhanden ist, kann das Auto der Linie nicht mehr folgen. Daher stellen wir das Reaktionsprogramm so ein, dass das Auto in die entgegengesetzte Richtung rückwärts fahren lässt (3) und dann in die ursprüngliche Richtung zurückkehrt, bis wieder eine schwarze Linie erkannt wird und vorwärts fährt (4).
ja: 場合によっては、特にカーブの半径が非常に小さい方向(1)に車が曲がる場合、車が軌道を使い果たして黒い線を検出できない場合がある(2)。このような場合に応答プログラムがないと、車は再び軌道を追うことができなくなる。したがって、車を反対方向に後退させるように応答プログラムを設定し(3)、次に黒い線が再び検出されるまで元の方向に戻り、前に進む(4)。

source: Functions Explanation
de: Funktionen Erklärung

source: The logic of the code is just as shown in the flow chart above.
de: Die Logik des Codes ist genau wie im obigen Flussdiagramm gezeigt.
ja: コードのロジックは、上記のフローチャートに示すとおりである。

source: Three Python modules are used in the code, including the imported **SunFounder_Line_Follower**, **front_wheels**, and **back_wheels**. They are the drivers for this kit, respectively for line following , front wheels, and rear wheels
de: Im Code werden drei Python-Module verwendet, darunter die importierten **SunFounder_Line_Follower**, **front_wheels** und **back_wheels**. Sie sind die Treiber für dieses Kit bzw. für die Linienverfolgung, Vorderräder und Hinterräder
ja: インポートされた**SunFounder_Line_Follower**、**front_wheels**、**back_wheels**を含む3つのPythonモジュールがコードで使用されている。これらはこのキットのドライバーであり、それぞれラインフォロー、前輪と後輪となっている。

source: The related classes have been defined here. When the modules are applied to use, objects will be created for related classes, and different parts of hardware will be driven by calling a function by the class object.
de: Die zugehörigen Klassen wurden hier definiert. Wenn die Module zur Verwendung angewendet werden, werden Objekte für verwandte Klassen erstellt, und verschiedene Teile der Hardware werden durch Aufrufen einer Funktion durch das Klassenobjekt gesteuert.
ja: 関連クラスはここで定義されている。モジュールを適用して使用すると、関連するクラスのオブジェクトが作成され、ハードウェアのさまざまな部分がクラスオブジェクトによる関数を呼び出すことによって駆動される。

source: Similar to the line following module, we create an object named **lf**:
de: Ähnlich wie beim zeilenfolgenden Modul erstellen wir ein Objekt namens **lf**:
ja: 次のモジュールと同様に、**lf**という名前のオブジェクトを作成する：

source: The parameter is initial, and then we can apply the function by calling a class object.
de: Der Parameter ist initial, und dann können wir die Funktion anwenden, indem wir ein Klassenobjekt aufrufen.
ja: パラメータは初期値であり、クラスオブジェクトを呼び出して関数を適用する。

source: This function is used to read the analog signal of all probes, and convert it into digital signal. If the signal is larger than the reference, the corresponding parameter will be 0; if it is lower than the reference, the parameter will be 1. There are five probes, thus we will get a 5-parameter list.
de: Diese Funktion wird verwendet, um das analoge Signal aller Sonden zu lesen und in ein digitales Signal umzuwandeln. Wenn das Signal größer als die Referenz ist, ist der entsprechende Parameter 0; wenn er niedriger als die Referenz ist, ist der Parameter 1. Es gibt fünf Sonden, daher erhalten wir eine 5-Parameter-Liste.
ja: この機能はすべてのプローブのアナログ信号を読み取り、それをデジタル信号に変換するために使用される。信号が参照よりも大きい場合、対応するパラメーターは0になり、基準より低い場合、パラメーターは1になる。プローブは5つあるため、5つのパラメーターのリストを取得する。

source: The function for front wheels' turning. The main program will call this function if applying the front wheels for turning. The parameter is the turning angle.
de: Die Funktion zum Drehen der Vorderräder. Das Hauptprogramm ruft diese Funktion auf, wenn die Vorderräder zum Wenden verwendet werden. Der Parameter ist der Drehwinkel.
ja: 前輪回転機能。メインプログラムは前輪を回す場合にこの関数を呼び出す。パラメータは回転角度となっている。

source: **bw.forward()**
de: **bw.vorwärts()**

source: Here we need two functions for rear wheels. One is to control the rotating direction as forward (for rotating backwards, **bw.backward()**). The second one is to set the rotating speed; the parameter is the speed value (range 0~100). The bigger the parameter is, the faster the wheel rotates.
de: Hier benötigen wir zwei Funktionen für Hinterräder. Eine besteht darin, die Drehrichtung vorwärts zu steuern (für Rückwärtsdrehung **bw.backward()**). Der zweite ist, die Rotationsgeschwindigkeit einzustellen; der Parameter ist der Geschwindigkeitswert (Bereich 0~100). Je größer der Parameter ist, desto schneller dreht sich das Rad.
ja: 後輪には2つの機能が必要である。1つは回転方向を順方向に制御する（後ろに回転するには、**bw.backward()**）。2つ目は回転速度を設定する。パラメータは速度の値である（範囲0〜100）。パラメータが大きければ大きいほど、ホイールの回転が速くなる。

source: **Functions Explanation**
ja: **機能説明**
