Repository: sunfounder/SunFounder_PiCar-S
Catalog: docs/locale/*/LC_MESSAGES/modules.po
Languages: de, ja

source: Modules
de: Module
ja: モジュール

source: Robot HATS
de: Roboter-HÜTE
ja: ロボットHATS

source: **Robot HATS** is a specially-designed HAT for a 40-pin Raspberry Pi and can work with Raspberry Pi 3 model B, 3 model B +, and 4 model B. It supplies power to the Raspberry Pi from the GPIO ports. Thanks to the design of the ideal diode based on the rules of HATS, it can supply the Raspberry Pi via both the USB cable and the DC port thus protecting it from damaging the TF card caused by batteries running out of power. The PCF8591 is used as the ADC chip, with I2C communication, and the address 0x48.
de: **Robot HATS** ist ein speziell entwickelter HAT für einen 40-poligen Raspberry Pi und kann mit Raspberry Pi 3 Modell B, 3 Modell B + und 4 Modell B arbeiten. Er versorgt den Raspberry Pi über die GPIO-Ports mit Strom . Dank des Designs der idealen Diode nach den Regeln von HATS kann sie den Raspberry Pi sowohl über das USB-Kabel als auch über den DC-Anschluss versorgen und schützt ihn so vor einer Beschädigung der TF-Karte durch leere Batterien. Als ADC-Chip wird der PCF8591 mit I2C-Kommunikation und der Adresse 0x48 verwendet.
ja: **ロボットHATS**は40ピンRaspberry Piに特別に設計されたHATであり、Raspberry Pi世代3モデルB、世代3モデルB +、世代4モデルBで動作し、GPIOポートからRaspberry Piに電力を供給する。HATSのルールに基づいた理想的なダイオードの設計により、USBケーブルとDCポートの両方を介してRaspberry Piに電源を供給できるため、バッテリーの電力不足によってTFカードが損傷することを防ぐことができる。PCF8591はI2C通信とアドレス0x48を備えたADCチップとして使用される。

source: **1.** **Digital ports**: 3-wire digital sensor ports, signal voltage: 3.3V, VCC voltage: 3.3V.
de: **1.** **Digitale Anschlüsse**: 3-Draht-Digitalsensoranschlüsse, Signalspannung: 3,3V, VCC-Spannung: 3,3V.
ja: **1.** **デジタルポート**：3線式デジタルセンサーポート、信号電圧：3.3V、VCC電圧：3.3V。

source: **2**. **Analog ports**: 3-wire 4-channel 8-bit ADC sensor port, reference voltage: 3.3V, VCC voltage: 3.3V.
de: **2**. **Analoge Anschlüsse**: 3-Draht-4-Kanal-8-Bit-ADC-Sensoranschluss, Referenzspannung: 3,3 V, VCC-Spannung: 3,3 V.
ja: **2.** **アナログポート**：3線4チャネル8ビットADCセンサーポート、基準電圧：3.3V、VCC電圧：3.3V。

source: **3.** **I2C ports**: 3.3V I2C bus ports
ja: **3.** **I2Cポート**：3.3V I2Cバスポート

source: **4**. **5V power output**: 5V power output to PWM driver.
de: **4**. **5V Stromausgang**: 5V Stromausgang zum PWM-Treiber.
ja: **4.** **5V電源出力**：PWMドライバーへの5V電源出力。

source: **5**. **UART port**: 4-wire UART port, 5V VCC, perfectly working with SunFounder FTDI Serial to USB.
de: **5**. **UART-Port**: 4-Draht-UART-Port, 5V VCC, funktioniert perfekt mit SunFounder FTDI Serial to USB.
ja: **5.** **UARTポート**：4線UARTポートと5V VCCはUSBへのSunFounder FTDIシリアルと完全に連携する。

source: **6**. **Motor control ports**: 5V for motors, direction control of motors MA and MB and a floating pin NC; working with motor driver module.
de: **6**. **Motorsteueranschlüsse**: 5V für Motoren, Richtungssteuerung der Motoren MA und MB und ein potentialfreier Pin NC; Arbeiten mit Motortreibermodul.
ja: **6.** **モーター制御ポート**：モーター用5V、モーターMAとMBの方向制御、フローティングピンNC、モータードライバーモジュールとの連携。

source: **7**. **Switch**: power switch
de: **7**. **Schalter**: Netzschalter
ja: **7.** **スイッチ**：電源スイッチ

source: **8**. **Power indicators**: indicating the voltage – 2 indicators on: >7.9V; 1 indicator on: 7.9V~7.4V; no indicator on: <7.4V. To protect the batteries, you're recommended to take them out for charge when there is no indicator on. The power indicators depend on the voltage measured by the simple comparator circuit; the detected voltage may be lower than normal depending on loads, so it is just for reference.
de: **8**. **Stromanzeigen**: Anzeige der Spannung – 2 Anzeigen an: >7,9V; 1 Anzeige an: 7,9V~7,4V; keine Anzeige an: <7,4V. Um die Batterien zu schützen, wird empfohlen, sie zum Laden herauszunehmen, wenn keine Anzeige leuchtet. Die Leistungsanzeigen hängen von der Spannung ab, die von der einfachen Komparatorschaltung gemessen wird; Die erkannte Spannung kann je nach Last niedriger als normal sein, daher dient sie nur als Referenz.
ja: **8.** **電源インジケータ**：電圧を指示する-2つのインジケータが点灯：> 7.9V。1つのインジケーター：7.9V〜7.4V。インジケータ点灯なし：<7.4V。バッテリーを保護するために、インジケーターが点灯していない場合は、充電する際にこれを取り出してください。電源インジケータは単純なコンパレータ回路によって測定された電圧に依存する。負荷によっては検出電圧が通常より低下する場合があるので参考値としてご利用ください。

source: **9**. **Power port**: 5.5/2.1mm standard DC port, input voltage: 8.4~7.4V (limited operating voltage: 12V~6V).
de: **9**. **Stromanschluss**: 5,5/2,1 mm Standard-DC-Anschluss, Eingangsspannung: 8,4 bis 7,4 V (begrenzte Betriebsspannung: 12 V bis 6 V).
ja: **9.** **電源ポート**：5.5/2.1mm標準DCポート、入力電圧：8.4〜7.4V（制限された動作電圧：12V〜6V）。

source: PCA9685 16-channel 12-bit I2C Bus PWM driver. It supports independent PWM output power and is easy to use 4-wire I2C port for connection in parallel, distinguished 3-color ports for PWM output.
de: PCA9685 16-Kanal-12-Bit-I2C-Bus-PWM-Treiber. Es unterstützt eine unabhängige PWM-Ausgangsleistung und ist ein einfach zu verwendender 4-Draht-I2C-Port für den Parallelanschluss, ausgezeichnete 3-Farben-Ports für den PWM-Ausgang.
ja: PCA9685 16チャネル12ビットI2CバスPWMドライバー。独立したPWM出力電力をサポートし、並列接続用の4線式I2Cポート、PWM出力用の区別された3色ポートをより簡単に利用できる。

source: 1. **PWM output ports**: 3-color ports, independent power PWM output port, connect to the servo directly.
ja: 1. **PWM出力ポート**：3色ポート、独立したパワーPWM出力ポート、サーボへの直接接続。

source: 2 & 3. **I2C port**: 4-wire I2C port, can be used in parallel. Compatible with 3.3V/5.5V
ja: 2 & 3. **I2Cポート**：4線式I2Cポートは並列で使用できる。3.3V/5.5Vに対応

source: **PWM power input**: 12V max.
ja: **PWM電源入力**：最大12V。

source: **LED**: power indicator for the chip and for the PWM power input.
ja: **LED**：チップとPWM電源入力用電源インジケータ。

source: Motor Driver Module
de: Motortreibermodul
ja: モータードライバーモジュール

source: The Motor Driver module is a low heat generation one and small packaged motor drive.
de: Das Motortreibermodul ist ein Motorantrieb mit geringer Wärmeentwicklung und einem kleinen Gehäuse.
ja: モータードライバーモジュールは低発熱の小型パッケージモータードライブである。

source: **1. Power and motor control port**: includes pins for supplying the chip and the motors and controlling the motors' direction
de: **1. Strom- und Motorsteuerungsanschluss**: enthält Pins zur Versorgung des Chips und der Motoren und zur Steuerung der Motorrichtung
ja: **1.電源とモーター制御ポート**：チップとモーターに電力を供給し、モーターの方向を制御するためのピンが含まれている。

source: **2. PWM input for the motors**: PWM signal input for adjusting the speed of the two motors
de: **2. PWM-Eingang für die Motoren**: PWM-Signaleingang zum Einstellen der Drehzahl der beiden Motoren
ja: **2.モーターのPWM入力**：2つのモーターの速度を調整するためのPWM信号入力。

source: **3. Motor output port**: output port for two motors
de: **3. Motorausgangsanschluss**: Ausgangsanschluss für zwei Motoren
ja: **3.モーター出力ポート**：2つのモーターの出力ポート

source: Line Follower Module
de: Linienfolgermodul
ja: ラインフォロワーモジュール

source: The TCRT5000 infrared photoelectric switch adopts a high transmit power infrared photodiode and a highly sensitive phototransistor. It works by applying the principle of objects' reflecting IR light – the light is emitted, then reflected, and sensed by the synchronous circuit. Then it determines whether there exists an object or not by the light intensity. It can easily identify black and white lines.
de: Der Infrarot-Lichtschranke TCRT5000 verwendet eine Infrarot-Fotodiode mit hoher Sendeleistung und einen hochempfindlichen Fototransistor. Es funktioniert nach dem Prinzip der Reflexion von IR-Licht von Objekten – das Licht wird emittiert, dann reflektiert und von der Synchronschaltung erfasst. Dann bestimmt es anhand der Lichtintensität, ob ein Objekt existiert oder nicht. Es kann leicht schwarze und weiße Linien erkennen.
ja: TCRT5000赤外線光電スイッチは高送信電力赤外線フォトダイオードと高感度フォトトランジスタを採用している。これは、オブジェクトのIR反射光の原理を適用することによって機能する。光は放射され、次に反射され、同期回路によって感知される。そして、光の強弱によって物体の有無を判断する。白黒の線を簡単に識別できる。

source: In other words, the different conduction levels of the phototransistor when it passes over black and white lines can generate different output voltages. Therefore, all we need to do is to collect data by the AD converter on the Atmega328 and then send the data to the master control board via I2C communication.
de: Mit anderen Worten können die unterschiedlichen Leitungspegel des Fototransistors beim Überfahren von schwarzen und weißen Leitungen unterschiedliche Ausgangsspannungen erzeugen. Daher müssen wir nur Daten vom AD-Wandler des Atmega328 sammeln und die Daten dann über die I2C-Kommunikation an die Master-Steuerplatine senden.
ja: 言い換えると、フォトトランジスタが黒と白のラインを通過するときの異なる伝導レベルにより、異なる出力電圧が生成される可能性がある。したがって、必要なのは、Atmega328のADコンバーターによってデータを収集し、I2C通信を介してマスターコントロールボードにデータを送信することだけである。

source: This module is an infrared tracking sensor one that uses 5 TRT5000 sensors. The blue LED of TRT5000 is the emission tube and after electrified it emits infrared light invisible to human eye. The black part of the sensor is for receiving; the resistance of the resistor inside changes with the infrared light received.
de: Dieses Modul ist ein Infrarot-Tracking-Sensor, der 5 TRT5000-Sensoren verwendet. Die blaue LED des TRT5000 ist die Emissionsröhre und sendet nach der Elektrifizierung für das menschliche Auge unsichtbares Infrarotlicht aus. Der schwarze Teil des Sensors dient zum Empfangen; der Widerstand des Widerstands im Inneren ändert sich mit dem empfangenen Infrarotlicht.
ja: このモジュールは5つのTRT5000センサーを使用する赤外線追跡センサーである。TRT5000の青色LEDは発光管であり、通電すると人間の目には見えない赤外光を発する。センサーの黒い部分は受信に使用される。内部の抵抗器の抵抗値は、受信した赤外線によって変化する。

source: Light Follower Module
de: Lichtfolgermodul
ja: ライトフォロワーモジュール

source: Phototransistor, also known as photodiode, is a device that converts light to current. Currents are generated when photons are absorbed in the P-N junction. When a reverse voltage is applied, the reverse current in the device will change with the light luminance. The stronger the light is, the larger the reverse current will be. Most phototransistors work this way.
de: Fototransistor, auch bekannt als Fotodiode, ist ein Gerät, das Licht in Strom umwandelt. Ströme werden erzeugt, wenn Photonen im P-N-Übergang absorbiert werden. Beim Anlegen einer Sperrspannung ändert sich der Sperrstrom im Gerät mit der Leuchtdichte des Lichts. Je stärker das Licht ist, desto größer ist der Rückstrom. Die meisten Fototransistoren arbeiten auf diese Weise.
ja: フォトトランジスターはフォトダイオードとも呼ばれ、光を電流に変換するデバイスである。フォトンがPNジャンクションで吸収されると、電流が生成される。逆電圧が印加されると、デバイスの逆電流は光の輝度とともに変化する。光が強いほど、逆電流が大きくなる。ほとんどのフォトトランジスタはこのように動作する。

source: The ADC chip on the HATS can receive 8-bit analog signals and convert them into integers, and transfer the signals to the Raspberry Pi. The Raspberry Pi will analyze the data to determine the direction of the brightest area (the light source), and further control the steering and movement of the four wheels to approach the light source.
de: Der ADC-Chip auf dem HATS kann 8-Bit-Analogsignale empfangen und in Ganzzahlen umwandeln und die Signale an den Raspberry Pi übertragen. Der Raspberry Pi analysiert die Daten, um die Richtung des hellsten Bereichs (der Lichtquelle) zu bestimmen und steuert ferner die Lenkung und Bewegung der vier Räder, um sich der Lichtquelle zu nähern.
ja: HATSのADCチップは8ビットのアナログ信号を受信して整数に変換し、信号をRaspberry Piに転送する。Raspberry Piはデータを分析して、最も明るい領域（光源）の方向を決定し、4つの車輪のステアリングと動きを制御して光源に近づける。

source: You may need a light focused flashlight in this experiment. At least, the spot size of the torch should not be too big to reach all the 3 phototransistors on the module at the same time. Well, you can also shine the flashlight closer to the car to get a small spot size.
de: Möglicherweise benötigen Sie für dieses Experiment eine lichtfokussierte Taschenlampe. Zumindest sollte die Spotgröße der Taschenlampe nicht zu groß sein, um alle 3 Fototransistoren auf dem Modul gleichzeitig zu erreichen. Nun, Sie können die Taschenlampe auch näher an das Auto richten, um eine kleine Spotgröße zu erhalten.
ja: この実験では、光に焦点を当てた懐中電灯が必用する。少なくとも、モジュールの3つのフォトトランジスタに同時に到達するために、トーチのスポットサイズは大きすぎてはならない。まあ、あなたは小さなスポットサイズを得るために車の近くに懐中電灯を照らすこともできる。

source: Ultrasonic Obstacle Avoidance Module
de: Ultraschall-Hindernisvermeidungsmodul
ja: 超音波障害物回避モジュール

source: The module contains an HC-SR04 ultrasonic distance sensor to detect the distance to an obstacle ahead. It is commonly used for robots to avoid obstacles. With the two holes, it can be easily mounted to the robot. A four foot anti-backwards cable is included to make the wiring tighter and easier.
de: Das Modul enthält einen Ultraschall-Abstandssensor HC-SR04 zur Erkennung des Abstands zu einem vorausliegenden Hindernis. Es wird häufig für Roboter verwendet, um Hindernissen auszuweichen. Mit den zwei Löchern kann es einfach am Roboter montiert werden. Ein vier Fuß langes Anti-Rückwärts-Kabel ist im Lieferumfang enthalten, um die Verkabelung straffer und einfacher zu machen.
ja: モジュールには、前方の障害物までの距離を検出する超音波距離センサHC-SR04が搭載されています。 ロボットが障害物を避けるためによく使われています。 2つの穴があるので、ロボットに簡単に取り付けることができます。 4ピンの逆戻り防止ケーブルが付属しているので、よりタイトで簡単に配線ができます。

source: The HC-SR04 ultrasonic distance sensor provides non-contact measurement from 2cm to 400cm with a range accuracy of 3mm. each HC-SR04 module includes an ultrasonic transmitter, a receiver and a control circuit, so we have to be careful with the Trig and Echo pin connections when using the HC-SR04 module. When we attach it to the picar-s, it measures the distance and detects if there is an obstacle ahead.
de: Der Ultraschall-Distanzsensor HC-SR04 ermöglicht eine berührungslose Messung von 2 cm bis 400 cm mit einer Messgenauigkeit von 3 mm. Jedes HC-SR04-Modul enthält einen Ultraschallsender, einen Empfänger und eine Steuerschaltung, daher müssen wir bei der Verwendung des HC-SR04-Moduls mit den Trig- und Echo-Pin-Anschlüssen vorsichtig sein. Wenn wir es am picar-s befestigen, misst es die Entfernung und erkennt, ob sich ein Hindernis vor Ihnen befindet.
ja: HC-SR04超音波距離センサは、2cmから400cmまでの距離を3mmの範囲精度で非接触で測定することができます。HC-SR04モジュールは、それぞれ超音波送信機、受信機、制御回路が含まれているため、HC-SR04モジュールを使用する際には、Trig端子とEcho端子の接続に注意する必要があります。 PiCar-Sに装着すると、距離を計測し、前方に障害物があるかどうかを検知します。

source: **Principle**
de: **Prinzip**
ja: **原理**

source: Supply a short 10μS pulse to the Trig to start the ranging, and then the module will send out an 8 cycle burst of ultrasound at 40 kHz and raise its echo back. The echo is a distance object that is pulse width and the range in proportion. You can calculate the :math:`\text{Range}` through the :math:`\text{Time Interval}` between sending trigger signal and receiving echo signal.
de: Geben Sie dem Trig einen kurzen 10μS-Impuls, um die Entfernungsmessung zu starten, und dann sendet das Modul einen Ultraschall-Burst mit 8 Zyklen bei 40 kHz aus und erhöht sein Echo zurück. Das Echo ist ein Distanzobjekt, das zur Impulsbreite und der Reichweite im Verhältnis steht. Sie können den :math:`\\text{Range}` durch den :math:`\\text{Time Interval}` zwischen dem Senden des Triggersignals und dem Empfangen des Echosignals berechnen.
ja: Trigに10usの短いパルスを供給してレンジングを開始し、モジュールは40 kHzで8サイクルの超音波バーストを送信し、Echoにエコーを上げる。エコーはパルス幅と距離に比例した距離オブジェクトである。トリガー信号を送信してからエコー信号を受信するまでの間に、Time Intervalを通じてRangeを計算できる。

source: Formula:
de: Formel:
ja: 式：

source: Or:
de: Oder:
ja: または：

source: We suggest to use over 60ms measurement cycle, so as to prevent trigger signal to the echo.
de: Wir empfehlen, einen Messzyklus von über 60 ms zu verwenden, um ein Triggersignal für das Echo zu verhindern.
ja: エコーへのトリガー信号を防ぐために、60ms以上の測定サイクルを使用してください。

source: SunFounder SF006C Servo
ja: SunFounder SF006Cサーボ

source: The SunFounder SF0180 Servo is a 180-degree three-wire digital servo. It utilizes PWM signal of 60Hz and has no physical limit – only control by internal software to 180 degrees at most.
de: Der SunFounder SF0180 Servo ist ein 180-Grad-Dreidraht-Digitalservo. Es verwendet ein PWM-Signal von 60 Hz und hat keine physikalische Begrenzung – nur Steuerung durch interne Software bis maximal 180 Grad.
ja: SunFounder SF0180サーボは180度の3線式デジタルサーボである。60HzのPWM信号を利用し、物理制限はない。最大180度までの内部ソフトウェアのみによって制御される。

source: Electrical Specifications:
de: Elektronische Spezifikationen:
ja: 電気仕様：

source: DC Gear Motor
de: DC-Getriebemotor
ja: DCギアモーター

source: It's a DC motor with a speed reducing gear train. See the parameters below:
de: Es ist ein Gleichstrommotor mit einem drehzahlreduzierenden Getriebezug. Siehe die Parameter unten:
ja: これは減速機付きのDCモーターである。以下のパラメーターを参照してください：

source: Copyright Notice
de: Urheberrechtshinweis
ja: 著作権表示

source: All contents including but not limited to texts, images, and code in this manual are owned by the SunFounder Company. You should only use it for personal study, investigation, enjoyment, or other non-commercial or nonprofit purposes, under the related regulations and copyrights laws, without infringing the legal rights of the author and relevant right holders. For any individual or organization that uses these for commercial profit without permission, the Company reserves the right to take legal action.
de: Alle Inhalte, einschließlich, aber nicht beschränkt auf Texte, Bilder und Code in diesem Handbuch, sind Eigentum der SunFounder Company. Sie sollten es nur für persönliche Studien, Recherchen, Genuss oder andere nicht-kommerzielle oder gemeinnützige Zwecke gemäß den entsprechenden Vorschriften und Urheberrechtsgesetzen verwenden, ohne die gesetzlichen Rechte des Autors und der entsprechenden Rechteinhaber zu verletzen. Für Einzelpersonen oder Organisationen, die diese ohne Erlaubnis zu kommerziellen Zwecken verwenden, behält sich das Unternehmen das Recht vor, rechtliche Schritte einzuleiten.
ja: このマニュアルのテキスト、画像とコードを含むがこれらに限定されないすべての内容は、SunFounder Companyが所有している。関連する規制と著作権法に基づき、著者と関連する権利所有者の法的権利を侵害することなく、個人的な研究、調査、享楽、またはその他の非営利目的でのみ使用してください。許可なく営利目的でこれを使用する個人または組織については、会社は法的措置を取る権利を留保する。

source: **1. PWM output ports**: 3-color ports, independent power PWM output port, connect to the servo directly.
de: **1. PWM-Ausgangsports**: 3-Farb-Ports, unabhängiger PWM-Ausgangsport, direkt an das Servo anschließen.

source: **2&3. I2C port**: 4-wire I2C port, can be used in parallel. Compatible with 3.3V/5.5V
de: **2&3. I2C-Port**: 4-Draht-I2C-Port, kann parallel verwendet werden. Kompatibel mit 3.3V/5.5V

source: **3. PWM power input**: 12V max.
de: **3. PWM-Stromeingang**: 12V max.

source: **4. LED**: power indicator for the chip and for the PWM power input.
de: **4. LED**: Stromanzeige für den Chip und für den PWM-Stromeingang.
