Repository: sunfounder/SunFounder_PiCar-S
Catalog: docs/locale/*/LC_MESSAGES/obstacle_avoidance.po
Languages: de, ja

source: Obstacle Avoidance
de: Hindernisvermeidung
ja: 障害物回避

source: How it Works
de: Wie es funktioniert
ja: 動作原理

source: The ultrasonic obstacle avoidance module detects and transfers the collected data to Raspberry Pi that can calculate the distance from the obstacle. The Pi will send a command to adjust the front wheels and rear wheels direction and rotation to control the PiCar-S walk away from the obstacle if there is one.
de: Das Ultraschall-Hindernisvermeidungsmodul erkennt und überträgt die gesammelten Daten an den Raspberry Pi, der den Abstand zum Hindernis berechnen kann. Der Pi sendet einen Befehl, um die Richtung und Drehung der Vorder- und Hinterräder einzustellen, um den PiCar-S vom Hindernis weg zu steuern, falls eines vorhanden ist.
ja: 超音波障害物回避モジュールは収集したデータを検出して、障害物からの距離を計算できるRaspberry Piに転送する。Piは前輪と後輪の方向と回転を調整するコマンドを送信して、障害物がある場合は障害物から離れてPiCar-Sを制御する。

source: Procedures
de: Verfahren
ja: 手順

source: **Step 1 Assembly**
de: **Schritt 1 Montage**
ja: **ステップ1 組み立て**

source: ① Connect the ultrasonic module to the ultrasonic connector with M1.4*8 screws and M1.4 nuts.
de: ① Ultraschallmodul mit M1.4*8 Schrauben und M1.4 Muttern an den Ultraschallstecker anschließen.
ja: ①超音波モジュールと超音波コネクタを M1.4*8 本のネジと M1.4 本のナットで接続します。

source: ② Then connect them to the ultrasonic support with M3*10 screws and M3 nuts.
de: ② Anschließend mit M3*10-Schrauben und M3-Muttern mit dem Ultraschallträger verbinden.
ja: ②次に、超音波サポートに M3*10 本のネジと M3 ナットで接続します。

source: ③ Finally,assemble them to the Upper Plate with M3*10 screws and M3 nuts.
de: ③ Schließlich montieren Sie sie mit M3*10 Schrauben und M3-Muttern an der oberen Platte.
ja: ③最後に、M3*10 本のネジと M3 ナットでアッパープレートに取り付けます。

source: **Reminder: It would be easier to place the nuts into the slots with your fingers to hold underneath.**
de: **Erinnerung: Es wäre einfacher, die Muttern mit den Fingern in die Schlitze zu legen, um sie darunter zu halten.**
ja: **注意：指でナットをスロットに入れて下に保持する方が簡単です。**

source: **Step 2 Wiring**
de: **Schritt 2 Verkabelung**
ja: **ステップ2 配線**

source: Connect the ultrasonic obstacle avoidance to Robot HATS with a 4-pin anti-reverse cable as shown below.
de: Verbinden Sie die Ultraschall-Hindernisvermeidung wie unten gezeigt mit einem 4-poligen Anti-Reverse-Kabel mit dem Robot HATS.
ja: 以下に示すように、4ピンのアンチリバースケーブルで超音波障害物回避装置をロボットHATSに接続する。

source: Ultrasonic module can have a 5V or 3.3V power supply. Here, we give it a 3.3V power supply.
de: Ultraschallmodul kann eine 5V oder 3,3V Stromversorgung haben. Hier geben wir ihm ein 3,3V Netzteil.
ja: 超音波モジュールは5Vまたは3.3Vの電源を持っていることがある。ここでは、3.3V電源を与える。

source: **Step 3 Test**
de: **Schritt 3 Test**
ja: **ステップ3 テスト**

source: First, test the ultrasonic obstacle avoidance module before applying.
de: Testen Sie zuerst das Ultraschall-Hindernisvermeidungsmodul, bevor Sie es anwenden.
ja: 適用する前に、まず超音波障害物回避モジュールをテストする。

source: You may find that the distance measurement may be not that accurate. It doesn’t matter. This 25kHz ultrasonic module is not a commonly used one, but one has a **horizontal detecting range of about 30~40 degrees**. Thus the distance measured may be not so accurate, but that small range provides convenience for obstacle avoidance. Besides, since the Raspberry Pi is not a real-time operating system, the inaccurate time calculation will affect the accuracy of distance measurement too. However, this ultrasonic module is precise enough for obstacle avoidance.
de: Sie werden möglicherweise feststellen, dass die Entfernungsmessung nicht so genau ist. Es spielt keine Rolle. Dieses 25-kHz-Ultraschallmodul ist kein häufig verwendetes, aber eines hat einen **horizontalen Erfassungsbereich von etwa 30~40 Grad**. Somit ist die gemessene Entfernung möglicherweise nicht so genau, aber dieser kleine Bereich bietet eine bequeme Hindernisvermeidung. Da der Raspberry Pi kein Echtzeit-Betriebssystem ist, wirkt sich die ungenaue Zeitberechnung auch auf die Genauigkeit der Entfernungsmessung aus. Dieses Ultraschallmodul ist jedoch präzise genug für die Hindernisvermeidung.
ja: 距離の測定がそれほど正確でない場合がある。大丈夫よ。この25kHzの超音波モジュールは汎用のものではないが、**約30〜40度の水平検出範囲を持っている**。したがって、測定された距離はそれほど正確ではないかもしれないが、その狭い範囲は障害物回避に便利である。さらに、Raspberry Piはリアルタイムのオペレーティングシステムではないため、不正確な時間計算は距離測定の精度にも影響する。ただし、この超音波モジュールは障害物を回避することに十分である。

source: **Step 4. Get on the road!**
de: **Schritt 4. Mach dich auf den Weg!**
ja: **ステップ4 旅に出よう！**

source: Now we have a general idea of the ultrasonic module’s effect after the test above. Let’s run the code of the ultrasonic obstacle avoidance.
de: Jetzt haben wir nach dem obigen Test eine allgemeine Vorstellung von der Wirkung des Ultraschallmoduls. Lassen Sie uns den Code der Ultraschall-Hindernisvermeidung ausführen.
ja: これで、上記のテスト後の超音波モジュールの効果の概要が分かるだろう。超音波障害物回避のコードを実行してみよう。

source: The PiCar-S starts running now. Just place the car on the ground. It will follow the program to turn when it detects an obstacle; if the obstacle is too close, it will move backwards, and turn left/right. You can also modify the threshold of obstacle detecting range and that of moving backwards in the code.
de: Der PiCar-S beginnt jetzt zu laufen. Stellen Sie das Auto einfach auf den Boden. Es folgt dem Programm zum Wenden, wenn es ein Hindernis erkennt; Wenn das Hindernis zu nahe ist, bewegt es sich rückwärts und dreht sich nach links/rechts. Sie können auch den Schwellenwert für die Hinderniserkennung und den für die Rückwärtsbewegung im Code ändern.
ja: 今のところ、PiCar-Sが起動した。車を地面に置くだけである。プログラムに従い、障害物を検出すると方向を転換する。障害物が近すぎる場合、後方に移動し、左/右に走行する。また、コードで障害物検出範囲のしきい値と後方に移動するしきい値を変更することもできる。

source: Code Explanation for ultra_sonic_avoid.py
de: Code-Erklärung für ultra_sonic_avoid.py
ja: ultra_sonic_avoid.pyのコードの説明

source: **Whole Work Flow**
de: **Gesamter Arbeitsablauf**
ja: **ワークフロー全体**

source: The ultrasonic module returns a digital value, i.e., High or Low level, and the interval time between two levels returned can be converted to the distance to the obstacle. Thus, we call the time module in Python for timing here. The formula to calculate the distance is written in the ultrasonic module’s driver. The main program just calls the corresponding program to get the distance value.
de: Das Ultraschallmodul gibt einen digitalen Wert zurück, d. h. High- oder Low-Pegel, und die Intervallzeit zwischen zwei zurückgegebenen Pegeln kann in die Entfernung zum Hindernis umgerechnet werden. Daher rufen wir hier das Zeitmodul in Python für das Timing auf. Die Formel zur Berechnung des Abstands ist in den Treiber des Ultraschallmoduls geschrieben. Das Hauptprogramm ruft einfach das entsprechende Programm auf, um den Distanzwert zu erhalten.
ja: 超音波モジュールはデジタル値、つまり高レベルまたは低レベルを返し、返された2つのレベル間の間隔時間を障害物までの距離に変換できる。したがって、ここではタイミングを求めるためにPythonでtimeモジュールを呼び出す。距離を計算する式は、超音波モジュールのドライバーに書き込まれる。メインプログラムは、対応するプログラムを呼び出して距離値を取得するだけである。

source: **Subflow of the Obstacle Avoidance Function**
de: **Teilablauf der Hindernisvermeidungsfunktion**
ja: **障害物回避機能のサブフロー**

source: When the car starts, it will detect obstacles and measure the distance in cycle, make judgement, and take actions. Here are three cases: when the distance to the obstacle is equals to the threshold, the car will turn directions; when the distance is less than the threshold, the car will move backwards before turning direction; when the distance is more than the threshold, it will keep moving forwards.
de: Wenn das Auto startet, erkennt es Hindernisse und misst die Distanz im Zyklus, trifft eine Beurteilung und ergreift Maßnahmen. Hier sind drei Fälle: Wenn der Abstand zum Hindernis gleich der Schwelle ist, wendet das Auto die Richtungen; wenn der Abstand kleiner als der Schwellenwert ist, bewegt sich das Auto rückwärts, bevor es in die Richtung abbiegt; Wenn die Entfernung den Schwellenwert überschreitet, bewegt es sich weiter vorwärts.
ja: 車が始動すると、障害物を検出して周期的に距離を測定したり、判断を下したり、行動を起こす。ここは三つのケースがある：障害物までの距離がしきい値と等しい場合、車は方向を変える。距離がしきい値を下回る場合、車は方向を変える前に後退する。距離がしきい値を超えると、続けて前進する。

source: Functions Explanation
de: Funktionen Erklärung

source: Create an object **ua** of a *UltraSonic_Avoidance* class in the Ultra_Sonic module. The number in the round bracket is the initial parameter, which represents the pin number the SIG of the module is connected to. Since the BCM naming method is applied, the corresponding pin on the Raspberry Pi is #17.
de: Erstellen Sie ein Objekt **ua** einer Klasse *UltraSonic_Avoidance* im Ultra_Sonic-Modul. Die Zahl in der runden Klammer ist der Anfangsparameter, der die Pinnummer darstellt, mit der das SIG des Moduls verbunden ist. Da die BCM-Benennungsmethode angewendet wird, ist der entsprechende Pin auf dem Raspberry Pi #17.
ja: Ultra_SonicモジュールでUltraSonic_Avoidanceクラスのオブジェクト**ua**を作成する。丸括弧内の数字は、モジュールのSIGが接続されているピン番号を表す初期パラメーターである。BCM命名方法が適用されているため、Raspberry Piの対応するピンは＃17である。

source: **back_distance** and **turn_distance**, two constants are to set the thresholds of the ranging distance.
de: **back_distance** und **turn_distance**, zwei Konstanten dienen zum Einstellen der Schwellenwerte der Entfernungsmessung.
ja: **back_distance**と**turn_distance**の2つの定数は測距距離のしきい値を設定するためのものである。

source: **while()** loop
de: **while()** Schleife

source: When the detected distance is less than the **back_distance**, the car will move backwards; when it is between **back_distance** and **turn_distance**, the car will turn a direction (you can set the turning angle in the aforementioned parameter **turning_angle** and the angle can be a positive or negative number, for turning left or turning right respectively; **NOTE** that the number of the turning angle should be **-90 to 90** considering the servo’s max rotation degrees, or the servo may be burnt.); when the detected distance is greater than the **turn_distance**, the car will keep moving forward.
de: Wenn die erkannte Distanz kleiner als die **back_distance** ist, bewegt sich das Auto rückwärts; wenn es zwischen **back_distance** und **turn_distance** liegt, wendet das Auto eine Richtung (Sie können den Wendewinkel im oben genannten Parameter **turning_angle** einstellen und der Winkel kann eine positive oder negative Zahl sein, für nach links bzw. nach rechts drehen **HINWEIS**, dass die Anzahl der Drehwinkel **-90 bis 90** unter Berücksichtigung der maximalen Rotationsgrade des Servos betragen sollte, da sonst das Servo verbrannt werden kann.); Wenn die erkannte Distanz größer als die **turn_distance** ist, fährt das Auto weiter.
ja: 検出された距離が**back_distance**より小さい場合、車は後方に移動する。距離は**back_distance**と**turn_distance**の間にある場合、車は方向を変える（前述のパラメータ**turning_angle**で回転角度を設定でき、角度は正または負の数で、それぞれ左または右に曲がることができる。サーボの最大回転角度を考慮すると、回転角度は**-90〜90度**であることを**注意**してください。そうしないと、サーボが焼ける恐れがある。）検出された距離が**turn_distance**より大きい場合、車は続けて前進する。

source: **bw.backward()**, making the rear wheels rotate backwards; **bw.forward()**, making the rear wheels spin forward. These two functions in the rear wheel driving module back_wheels are to set the wheel’s rotating direction.
de: **bw.backward()**, wodurch sich die Hinterräder rückwärts drehen; **bw.forward()**, wodurch sich die Hinterräder vorwärts drehen. Diese beiden Funktionen im Hinterradantriebsmodul back_wheels dienen dazu, die Drehrichtung des Rades einzustellen.
ja: **bw.backward()**、後輪を後方に回転させる。** bw.forward()**、後輪を前方に回転させる。後輪駆動モジュールback_wheelsのこれら2つの機能は車輪の回転方向を設定するために使用される。

source: **bw.set_speed(speed)**, function in the back_wheels, to set the wheel's rotating speed. The larger the number (within the range 0-100) is, the faster the wheel rotates.
de: **bw.backward()**, sich die Hinterräder rückwärts drehen; **bw.forward()**, sich die Hinterräder vorwärts drehen. Diese beiden Funktionen im Hinterradantriebsmodul dienen dazu, die Drehrichtung des Rades einzustellen.
ja: **bw.set_speed(speed) **、back_wheelsの関数で、ホイールの回転速度を設定する。数値が大きければ大きいほど（0〜100の範囲内）、ホイールの回転が速くなる。

source: **fw.turn(angle)**, function in the back_wheels, to set the turning angle. The angle is 90 when the car moves straight forwards; reduce the number to turn left, and increase it to turn right.
de: **fw.turn(angle)**, Funktion in den back_wheels, um den Drehwinkel einzustellen. Der Winkel beträgt 90, wenn das Auto geradeaus fährt; Verringern Sie die Zahl, um nach links abzubiegen, und erhöhen Sie sie, um nach rechts abzubiegen.
ja: **fw.turn(angle) **、back_wheelsの関数で、回転角度を設定する。車が直進するときの角度は90度で、左折するには数値を減らし、右折するには数値を増やす。

source: **fw.turn_straight()**, making the front wheels return to the angle of moving straight forwards.
de: **fw.turn_straight()**, wodurch die Vorderräder in den Winkel zurückkehren, in dem sie sich geradeaus bewegen.
ja: **fw.turn_straight()**、前輪を直進する角度に戻す。

source: **More:**
de: **Mehr:**
ja: **詳細：**

source: **back_distance** and **turn_distance**
de: **back_distance** und **turn_distance**
ja: **back_distance**と**turn_distance**

source: Try to modify the constants to make the car back off and turn away in a desired distance and angle as you like during the obstacle avoidance.
de: Versuchen Sie, die Konstanten so zu ändern, dass das Auto während der Hindernisvermeidung nach Belieben zurückfährt und in einem gewünschten Abstand und Winkel abbiegt.
ja: 定数を変更して、車をオフに戻し、障害物回避中に希望の距離と角度で離れるようにしてください。

source: **Functions Explanation**
ja: **機能説明**
