Repository: sunfounder/SunFounder_PiCar-S
Catalog: docs/locale/*/LC_MESSAGES/servo_configuration.po
Languages: de, ja

source: Servo Configuration
de: Servokonfiguration
ja: サーボ構成

source: Since the servos used in this kit are adjusted by software and there's no such physical sticking point as other servos, here we need to configure the servo via software. First you need to finish some software installation before the configuration.
de: Da die in diesem Bausatz verwendeten Servos per Software eingestellt werden und es keinen physikalischen Knackpunkt wie bei anderen Servos gibt, müssen wir hier das Servo per Software konfigurieren. Zuerst müssen Sie einige Softwareinstallationen vor der Konfiguration abschließen.
ja: また、このキットで使用されるサーボはソフトウェアによって調整され、他のサーボほど物理的な固定点がないため、ここではソフトウェアを介してサーボを構成する。最初に、構成の前にソフトウェアの実装を完了してください。

source: Please do forget to put in the battery and slide the power switch to ON in following chapters.
de: Bitte vergessen Sie in den folgenden Kapiteln, den Akku einzulegen und den Netzschalter auf ON zu schieben.
ja: 本章では、バッテリーを取り付けて電源スイッチをONにスライドすることを忘れないでください。

source: Get Source Code
de: Quellcode abrufen
ja: ソースコードを取得する

source: You can find the source code in our Github repositories. Download the source code by *git clone*:
de: Den Quellcode finden Sie in unseren Github-Repositorys. Laden Sie den Quellcode von *git clone* herunter:
ja: ソースコードはGithubリポジトリにある。git cloneでソースコードをダウンロードする：

source: Please pay attention to your typing – if you get the prompt of entering your user name and password, you may have typed wrong. If unluckily you did so, press Ctrl + C to exit and try again.
de: Bitte achten Sie auf Ihre Eingabe – wenn Sie aufgefordert werden, Ihren Benutzernamen und Ihr Passwort einzugeben, haben Sie sich möglicherweise falsch getippt. Wenn Sie dies unglücklicherweise getan haben, drücken Sie zum Beenden Strg + C und versuchen Sie es erneut.
ja: 入力時に十分に注意してください。ユーザー名とパスワードの入力を求められた場合は、入力を間違えている可能性がある。それは発生した場合、Ctrl+Cを押して終了し、再試行してください。

source: Check by the **ls** command, then you can see the code directory *SunFounder_PiCar-S*:
de: Überprüfen Sie mit dem **ls** Befehl, dann sehen Sie das Code-Verzeichnis *SunFounder_PiCar-S*:
ja: **ls**コマンドで確認すると、コードディレクトリ**SunFounder_PiCar-S**が表示される：

source: Go to the Code Directory
de: Gehe zum Codeverzeichnis
ja: コードディレクトリに入る

source: Enter the code directory and you can see the installation script:
de: Geben Sie das Codeverzeichnis ein und Sie können das Installationsskript sehen:
ja: コードディレクトリに入ると、インストールスクリプトが表示される：

source: Install the Environment via Script
de: Installieren Sie die Umgebung per Skript
ja: スクリプトを介して環境をインストールする

source: You can get all the required software and configuration done with the installation script. If you want to do step by step instead, refer to the operations in **Appendix 1: Installing Manually**.
de: Sie können die gesamte erforderliche Software und Konfiguration mit dem Installationsskript durchführen. Wenn Sie stattdessen Schritt für Schritt vorgehen möchten, lesen Sie die Vorgänge in **Anhang 1: Manuelle Installation**.
ja: インストールスクリプトを使用して、必要なすべてのソフトウェアと構成を実行することはできる。代わりに一歩一歩に実行する場合は、「**付録1：手動によるインストール**」の手順に従ってください。

source: The installation script will install the required components and configure for the running environment. Make sure your Raspberry Pi is connected to the Internet during the installation, or it would fail.
de: Das Installationsskript installiert die erforderlichen Komponenten und konfiguriert sie für die laufende Umgebung. Stellen Sie sicher, dass Ihr Raspberry Pi während der Installation mit dem Internet verbunden ist, sonst würde er fehlschlagen.

source: The Raspberry Pi will prompt you to reboot after the installation. You're recommended to type in **yes** to reboot.
de: Der Raspberry Pi fordert Sie nach der Installation zum Neustart auf. Es wird empfohlen, **yes** einzugeben, um neu zu starten.

source: Set the Servo to 90 Degrees
de: Stellen Sie den Servo auf 90 Grad ein
ja: サーボを90度に設定する

source: After reboot, type in the command:
de: Geben Sie nach dem Neustart den Befehl ein:
ja: 再起動後、次のコマンドを入力する：

source: You can see three commands here.
de: Hier sehen Sie drei Befehle.
ja: ここに3つのコマンドが表示される。

source: The first one **servo-install** is for **servo adjustment**, which is used after the front wheels are assembled. The servo will rotate to 90 degrees after this command is run, so we will use this command here.
de: Die erste **servo-install** dient der **Servoeinstellung**, die nach der Montage der Vorderräder verwendet wird. Nachdem dieser Befehl ausgeführt wurde, dreht sich das Servo um 90 Grad, daher verwenden wir diesen Befehl hier.
ja: 最初の1つは、前輪を組み立てた後に使用する**サーボ調整**用の**servo-install**である。このコマンドを実行するとサーボが90度回転するため、ここではこのコマンドを使用する。

source: If the "OSError: [Errno 121] Remote I/O error" error message appears, open raspi-config:
de: Wenn die Fehlermeldung "OSError: [Errno 121] Remote I/O error" erscheint, öffnen Sie raspi-config:
ja: 「OSError：[Errno 121] Remote I/O error」エラーメッセージが表示された場合は、raspi-configを開く：

source: Then choose **3 Interfacing Options** → **P5 I2C** → **<YES>** →\ **OK** to enable I2C service. You can use the up, down, left, and right keys on the keyboard to select, and then press Enter to confirm.
de: Wählen Sie dann **3 Schnittstellenoptionen** → **P5 I2C** → **<JA>** →\ **OK**, um den I2C-Dienst zu aktivieren. Sie können die Aufwärts-, Abwärts-, Links- und Rechtstasten auf der Tastatur verwenden, um auszuwählen, und dann zur Bestätigung die Eingabetaste drücken.
ja: 次に、**3 Interfacing Options** → <**P5 I2C**> →<**YES**> → <**OK**>を選択してI2Cサービスを有効にします。 キーボードの上、下、左、右のキーを使って選択できます、最後は<Enter>キーを押して確認します。

source: After the code is running, insert the rocker arm into the servo. You will see the rocker arm is rotate in clockwise and counterclockwise, then stop at a specific location. It means the servo is good. If the any of the conditions below happened to your servo, your servo is bad:
de: Nachdem der Code ausgeführt wurde, fügen Sie den Kipphebel in das Servo ein. Sie werden sehen, dass sich der Kipphebel im Uhrzeigersinn und gegen den Uhrzeigersinn dreht und dann an einer bestimmten Stelle stoppt. Es bedeutet, dass das Servo gut ist. Wenn eine der folgenden Bedingungen bei Ihrem Servo auftritt, ist Ihr Servo schlecht:
ja: コードの実行後、ロッカーアームをサーボに差し込む。ロッカーアームが時計回りと反時計回りに回転し、特定の位置で停止する。サーボが良い状態にあると示す。以下の条件のいずれかがサーボに発生した場合、サーボは不良である：

source: Noisy, hot.
de: Laut, heiß.
ja: 雑音あり、熱い。

source: If unplug the servo line and rotate the rocker arm, it sounds like “ka” “ka” “ka” or there has no sounds of gear driving.
de: Wenn Sie die Servoleitung abziehen und den Kipphebel drehen, klingt es wie "ka" "ka" "ka" oder es gibt keine Geräusche vom Getriebe.
ja: サーボラインを抜いてロッカーアームを回すと「カ」「カ」「カ」のように聞こえるか、またはギアの駆動音が鳴らさない。

source: Rotate slowly but continuously.
de: Drehen Sie langsam, aber kontinuierlich.
ja: ゆっくりで継続的に回してください。

source: If you find one of the conditions above, please send e-mail to `service@sunfounder.com <mailto:support@sunfounder.com>`__ . We will change a new one to you. If it is broken in the process of using or assembling, you should go to the official website `www.sunfounder.com <http://www.sunfounder.com>`__ to buy.
de: Wenn Sie eine der oben genannten Bedingungen finden, senden Sie bitte eine E-Mail an `service@sunfounder.com <mailto:support@sunfounder.com>`__ . Wir werden ein neues für Sie ändern. Wenn es während der Verwendung oder Montage beschädigt wird, sollten Sie auf die offizielle Website `www.sunfounder.com <http://www.sunfounder.com>`__ gehen, um es zu kaufen.
ja: 上記の状況のいずれかが発生した場合は、**service@sunfounder.com**に送信してください。新品に交換してあげる。使用または組み立ての過程で破損した場合は、公式ウェブサイト **http://www.sunfounder.com**_にて購入してください。

source: Build the Rest of the Car
de: Baue den Rest des Autos
ja: 車の残り部分を組み立てる

source: Please keep the command **servo-install** running in the whole process of assembly.
de: Bitte lassen Sie den Befehl **servo-install** während des gesamten Montageprozesses laufen.
ja: アセンブリのプロセス全体で、servo-installコマンドを実行し続けてください。

source: Mount the steering servo to the Upper Plate with two **M2x8 Screws** and two **M2 nuts** (pay attention to the direction of the servo wires):
de: Montieren Sie das Lenkservo mit zwei **M2x8 Schrauben** und zwei **M2 Muttern** an der oberen Platte (achten Sie auf die Richtung der Servokabel):
ja: 2つの**M2x8ネジ**と**M2ナット**を使ってステアリングサーボを上部プレートに取り付ける（サーボワイヤーの方向に注意してください）：

source: The **Rocker Arm** is facing straight ahead, and then inserted into the Servo shaft, and then fixed with **Rocker Arm Fixing Screw** (the shortest).
de: Der **Kipphebel** zeigt gerade nach vorne und wird dann in die Servowelle eingeführt und dann mit der **Kipphebel-Befestigungsschraube** (der kürzesten) befestigt.
ja: **ロッカーアーム固定ネジ**（最短）で**ステアリングリンケージ**を**ロッカーアーム**に接続する。

source: Mount the wheels onto the Upper Plate carefully.
de: Montieren Sie die Räder vorsichtig auf der oberen Platte.
ja: ホイールを上部プレートに入念に取り付ける。

source: Then put the assembled Front Half Chassis onto the Upper Plate with standoffs aligned with the holes.
de: Setzen Sie dann das zusammengebaute vordere halbe Chassis auf die obere Platte, wobei die Abstandshalter mit den Löchern ausgerichtet sind.
ja: 次に、組み立てられたフロントハーフシャーシを、スタンドオフを穴に合わせている上部プレートに置く。

source: Hold them carefully, turn upside down, and fasten the standoffs and the Upper Plate with four **M3x8 screws**:
de: Halten Sie sie vorsichtig fest, drehen Sie sie auf den Kopf und befestigen Sie die Abstandshalter und die obere Platte mit vier **M3x8-Schrauben**:
ja: 入念に持ち、上下を逆にして、4本の**M3x8ネジ**でスタンドオフと上部プレートを固定する。

source: **So now, the whole assembly is DONE! Congratulations!**
de: **So, jetzt ist die gesamte Montage FERTIG! Glückwünsche!**
ja: **これで、アセンブリ全体が完了した。おめでとう！**

source: 1. The installation script will install the required components and configure for the running environment. Make sure your Raspberry Pi is connected to the Internet during the installation, or it would fail.
ja: 1. インストールスクリプトは、必要な部品をインストールし、動作環境用に構成する。インストール中にRaspberry Piがインターネットに接続されていることを確認してください。接続しない場合は、失敗する恐れがある。

source: 2. The Raspberry Pi will prompt you to reboot after the installation. You're recommended to type in **yes** to reboot.
ja: 2. インストールを完了した後、Raspberry Piは再起動すると示す。再起動するにはyesと入力してください。
